<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
  <meta charset="utf-8">
  
  <title>侃侃--深圳 | eval&#39;s blog</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x9752;&amp;#x6625;&amp;#x7684;&amp;#x5C81;&amp;#x6708;&amp;#xFF0C;&amp;#x6211;&amp;#x8EAB;&amp;#x4E0D;&amp;#x7531;&amp;#x5DF1;&amp;#xFF1B; &amp;#x53EA;&amp;#x56E0;&amp;#x8FD9;&amp;#x80F8;&amp;#x4E2D;&amp;#xFF0C;&amp;#x71C3;&amp;#x70E7;&amp;#x7684;&amp;#x68A6;&amp;#x60F3;&amp;#xFF1B; &amp;#x975">
<meta name="keywords" content="侃侃 深圳">
<meta property="og:type" content="article">
<meta property="og:title" content="侃侃--深圳">
<meta property="og:url" content="http://everyding.github.io/2011/05/29/see-shenzhen/index.html">
<meta property="og:site_name" content="eval&#39;s blog">
<meta property="og:description" content="&amp;#x9752;&amp;#x6625;&amp;#x7684;&amp;#x5C81;&amp;#x6708;&amp;#xFF0C;&amp;#x6211;&amp;#x8EAB;&amp;#x4E0D;&amp;#x7531;&amp;#x5DF1;&amp;#xFF1B; &amp;#x53EA;&amp;#x56E0;&amp;#x8FD9;&amp;#x80F8;&amp;#x4E2D;&amp;#xFF0C;&amp;#x71C3;&amp;#x70E7;&amp;#x7684;&amp;#x68A6;&amp;#x60F3;&amp;#xFF1B; &amp;#x975">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-03-07T06:52:28.481Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="侃侃--深圳">
<meta name="twitter:description" content="&amp;#x9752;&amp;#x6625;&amp;#x7684;&amp;#x5C81;&amp;#x6708;&amp;#xFF0C;&amp;#x6211;&amp;#x8EAB;&amp;#x4E0D;&amp;#x7531;&amp;#x5DF1;&amp;#xFF1B; &amp;#x53EA;&amp;#x56E0;&amp;#x8FD9;&amp;#x80F8;&amp;#x4E2D;&amp;#xFF0C;&amp;#x71C3;&amp;#x70E7;&amp;#x7684;&amp;#x68A6;&amp;#x60F3;&amp;#xFF1B; &amp;#x975">
  
    <link rel="alternative" href="/atom.xml" title="eval&#39;s blog" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.ico">
  
  <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  <link rel="stylesheet" href="/css/style.css">
  

</head></html>
<body>
  <div id="container">
    <div id="wrap">
      <div class="outer">
        <section id="main"><article id="post-see-shenzhen" class="article article-type-post" itemscope itemprop="blogPost">
  
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      侃侃--深圳
    </h1>
  

      </header>
    
    <div class="article-meta">
      <a href="/2011/05/29/see-shenzhen/" class="article-date">
  <time datetime="2011-05-28T18:57:21.000Z" itemprop="datePublished">2011-05-29 02:57:21</time>
</a>
      
    </div>
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x9752;&#x6625;&#x7684;&#x5C81;&#x6708;&#xFF0C;&#x6211;&#x8EAB;&#x4E0D;&#x7531;&#x5DF1;&#xFF1B;</p>
<p>&#x53EA;&#x56E0;&#x8FD9;&#x80F8;&#x4E2D;&#xFF0C;&#x71C3;&#x70E7;&#x7684;&#x68A6;&#x60F3;&#xFF1B;</p>
<p>&#x9752;&#x6625;&#x7684;&#x5C81;&#x6708;&#xFF0C;&#x653E;&#x6D6A;&#x7684;&#x751F;&#x6DAF;&#xFF1B;</p>
<p>&#x5C31;&#x8BA9;&#x8FD9;&#x65F6;&#x5149;&#xFF0C;&#x5954;&#x817E;&#x5982;&#x6D41;&#x6C34;&#xFF1B;</p>
<p>&#x4F53;&#x4F1A;&#x8FD9;&#x72C2;&#x91CE;&#xFF0C;&#x4F53;&#x4F1A;&#x5B64;&#x72EC;&#xFF1B;</p>
<p>&#x4F53;&#x4F1A;&#x8FD9;&#x6B22;&#x4E50;&#xFF0C;&#x7231;&#x6068;&#x79BB;&#x522B;&#xFF1B;</p>
<a id="more"></a>
<p>&#x8FD9;&#x662F;&#x6211;&#x7684;&#x5B8C;&#x7F8E;&#x751F;&#x6D3B;&#xFF0C;&#x4E5F;&#x662F;&#x4F60;&#x7684;&#x5B8C;&#x7F8E;&#x751F;&#x6D3B;&#xFF1B;</p>
<p>&#x6211;&#x591A;&#x60F3;&#x770B;&#x5230;&#x4F60;&#xFF0C;&#x90A3;&#x4F9D;&#x65E7;&#x707F;&#x70C2;&#x7684;&#x7B11;&#x5BB9;&#xFF1B;</p>
<p>&#x518D;&#x4E00;&#x6B21;&#x91CA;&#x653E;&#x81EA;&#x5DF1;&#xFF0C;&#x80F8;&#x4E2D;&#x90A3;&#x707F;&#x70C2;&#x7684;&#x60C5;&#x611F;&#x3002;</p>
<p>&#x2026; &#x2026;</p>
<p>&#x604D;&#x60DA;&#x95F4;&#xFF0C;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x8F6C;&#x949F;&#x4E86;&#xFF0C;&#x65E5;&#x671F;&#x5237;&#x65B0;&#x4E3A;5&#x6708;29&#x65E5;&#xFF08;&#x519C;&#x5386;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x662F;&#x6211;&#x7684;&#x751F;&#x65E5;&#xFF09;&#xFF0C;&#x63D0;&#x63D0;&#x795E;&#xFF0C;&#x70B9;&#x71C3;&#x4E00;&#x652F;&#x70DF;&#xFF0C;&#x6211;&#x6DF1;&#x5438;&#x4E00;&#x53E3;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x70DF;&#x8482;&#x8F7B;&#x8F7B;&#x5730;&#x5F39;&#x51FA;&#xFF0C;&#x53EA;&#x542C;&#x89C1;&#x7B14;&#x8BB0;&#x672C;CPU&#x98CE;&#x6247;&#x5FFD;&#x5FFD;&#x7684;&#x8F6C;&#x52A8;&#x58F0;&#x3002;</p>
<p>4&#x6708;17&#x65E5;&#x4ECE;&#x4E1C;&#x839E;4305&#x54C1;&#x724C;&#x8BBE;&#x8BA1;&#x516C;&#x53F8;&#x79BB;&#x804C;&#xFF0C;&#x5230;&#x4ECA;&#x5929;&#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x534A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5728;&#x90A3;&#x4E2A;&#x516C;&#x53F8;&#x5DE5;&#x4F5C;&#x4E86;8&#x4E2A;&#x6708;&#xFF0C;&#x8BB0;&#x5F97;&#x8D70;&#x7684;&#x65F6;&#x5019;&#x8001;&#x677F;&#x5F88;&#x662F;&#x4E0D;&#x60C5;&#x613F;&#xFF0C;&#x56E0;&#x4E3A;&#x4E4B;&#x524D;&#x8BF4;&#x597D;&#x662F;&#x505A;&#x4E00;&#x5E74;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x6700;&#x540E;&#x8001;&#x677F;&#x8FD8;&#x662F;&#x7ED3;&#x4E86;&#x6211;&#x5168;&#x90E8;&#x7684;&#x5DE5;&#x8D44;&#xFF0C;&#x8D70;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x5BF9;&#x6211;&#x8D5E;&#x8D4F;&#x4E86;&#x4E00;&#x756A;&#xFF0C;&#x8BF4;&#x6211;&#x5F88;&#x4F18;&#x79C0;&#x5DE5;&#x4F5C;&#x8D1F;&#x8D23;&#xFF0C;&#x9002;&#x5408;&#x505A;&#x7A0B;&#x5E8F;&#x5458;&#xFF01;&#x6211;&#x7EC8;&#x7A76;&#x662F;&#x79BB;&#x5F00;&#x4E86;&#xFF0C;&#x8BB0;&#x5F97;&#x90A3;&#x5929;&#x662F;&#x661F;&#x671F;&#x5929;&#xFF0C;&#x6211;&#x6574;&#x7406;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x884C;&#x674E;&#xFF0C;&#x7136;&#x540E;&#x7ED9;&#x4EB2;&#x621A;&#x6253;&#x4E86;&#x4E2A;&#x7535;&#x8BDD;&#x8FC7;&#x6765;&#x5E2E;&#x6211;&#x642C;&#x8FD0;&#x884C;&#x674E;&#xFF0C;&#x8D70;&#x7684;&#x65F6;&#x5019;&#x7ED9;&#x4E4B;&#x524D;&#x90A3;&#x4E2A;&#x516C;&#x53F8;&#x7684;&#x6240;&#x6709;&#x540C;&#x4E8B;&#x9053;&#x522B;&#xFF01;&#x79BB;&#x5F00;&#xFF01;</p>
<p>&#x5230;&#x4E86;&#x4EB2;&#x621A;&#x5BB6;&#xFF0C;&#x4E2D;&#x5348;&#x8205;&#x5988;&#x6574;&#x4E86;&#x4E00;&#x684C;&#x7F8E;&#x5473;&#xFF0C;&#x4E0D;&#x4E00;&#x4F1A;&#x513F;&#x7684;&#x529F;&#x592B;&#x8205;&#x8205;&#x63D0;&#x7740;&#x9152;&#x4E0A;&#x6765;&#xFF0C;&#x662F;&#x6211;&#x6700;&#x7231;&#x559D;&#x7684;&#x8001;&#x9752;&#x5C9B;&#xFF0C;&#x996D;&#x684C;&#x95F4;&#x6211;&#x8DDF;&#x4ED6;&#x4EEC;&#x804A;&#x4E86;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x548C;&#x751F;&#x6D3B;&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x7410;&#x4E8B;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x8D5E;&#x540C;&#x6211;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x8BF4;&#x8BA9;&#x6211;&#x4E0D;&#x8981;&#x5FC3;&#x6025;&#xFF0C;&#x627E;&#x5DE5;&#x4F5C;&#x6162;&#x6162;&#x6765;&#xFF01;&#x4EFF;&#x4F5B;&#x53C8;&#x56DE;&#x5230;&#x5BB6;&#x91CC;&#x7684;&#x611F;&#x89C9;&#x4E00;&#x822C;&#xFF01;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x7684;&#x6211;&#x5DF2;&#x7ECF;&#x5F88;&#x5E73;&#x9759;&#x4E86;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x90FD;&#x8981;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#xFF01;&#x7136;&#x540E;&#x6211;&#x8BF4;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x6211;&#x8981;&#x53BB;&#x6DF1;&#x5733;&#xFF01;&#x7528;&#x8868;&#x54E5;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x8BF4;&#xFF1A;&#x4E1C;&#x839E;&#x6BD5;&#x7ADF;&#x662F;&#x4E00;&#x4E2A;&#x5236;&#x9020;&#x4E1A;&#x57CE;&#x5E02;&#xFF0C;IT&#xFF08;&#x6328;&#x8E22;&#xFF09;&#x4E1A;&#x6BD5;&#x7ADF;&#x4E0D;&#x6210;&#x719F;&#xFF0C;&#x5728;&#x6DF1;&#x5733;&#x4F1A;&#x6709;&#x8DDF;&#x591A;&#x7684;&#x6311;&#x6218;&#x548C;&#x66F4;&#x5927;&#x7684;&#x5B66;&#x4E60;&#x673A;&#x4F1A;&#xFF01;&#x5176;&#x5B9E;&#x5728;&#x79BB;&#x5F00;&#x4E1C;&#x839E;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x66FE;&#x7ECF;&#x95EE;&#x8FC7;&#x5F88;&#x591A;&#x524D;&#x8F88;&#xFF0C;&#x8FD8;&#x7ED9;&#x521A;&#x54E5;&#xFF08;&#x9AD8;&#x4E2D;&#x5144;&#x5F1F;&#x9648;&#x5F3A;&#x4ED6;&#x54E5;&#xFF09;&#x6253;&#x8FC7;&#x597D;&#x51E0;&#x6B21;&#x7535;&#x8BDD;&#xFF0C;&#x5728;CSDN&#x4E0A;&#x53D1;&#x5E16;&#xFF0C;&#x6700;&#x7EC8;&#x4E00;&#x4E2A;&#x7ED3;&#x8BBA;&#xFF0C;&#x9009;&#x62E9;&#x6DF1;&#x5733;&#xFF0C;&#x5FC5;&#x987B;&#x7684;&#xFF01;&#x5176;&#x5B9E;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x591A;&#x8651;&#xFF0C;&#x5728;&#x51B3;&#x5B9A;&#x4E00;&#x4E2A;&#x4E8B;&#x60C5;&#x53D1;&#x751F;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4F1A;&#x95EE;&#x5F88;&#x591A;&#x957F;&#x8005;&#x7684;&#x610F;&#x89C1;&#x548C;&#x5EFA;&#x8BAE;&#xFF0C;&#x6700;&#x7EC8;&#x505A;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x51B3;&#x5B9A;&#xFF01;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x5BB6;&#x91CC;&#x90A3;&#x8FB9;&#x51E0;&#x4E4E;&#x662F;&#x5929;&#x5929;&#x90FD;&#x80FD;&#x63A5;&#x5230;&#x4ED6;&#x4EEC;&#x6253;&#x7684;&#x7535;&#x8BDD;&#xFF0C;&#x7238;&#x3001;&#x5988;&#x548C;&#x59D0;&#x4E00;&#x6253;&#x5C31;&#x662F;&#x534A;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x6211;&#x4E5F;&#x77E5;&#x9053;&#x4ED6;&#x4EEC;&#x4E3A;&#x6211;&#x62C5;&#x5FC3;&#x4E86;&#x3002;</p>
<p>&#x5728;&#x4EB2;&#x621A;&#x5BB6;&#x5148;&#x4F4F;&#x4E86;&#x4E00;&#x4E2A;&#x661F;&#x671F;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x6CA1;&#x6709;&#x6536;&#x83B7;&#x7684;&#xFF0C;&#x6536;&#x83B7;&#x5C31;&#x662F;&#x6211;&#x6559;&#x4F1A;&#x4E86;&#x4ED6;&#x4EEC;&#x73A9;&#x7535;&#x8111;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x662F;70&#x540E;&#x4E86;&#xFF0C;&#x63A5;&#x89E6;&#x7535;&#x8111;&#x4E5F;&#x4E0D;&#x7B97;&#x591A;&#x800C;&#x4E14;&#x5DE5;&#x4F5C;&#x4E2D;&#x8DDF;&#x7535;&#x8111;&#x6253;&#x4EA4;&#x9053;&#x4E5F;&#x4E0D;&#x591A;&#x3002;&#x6253;&#x5F00;&#x7535;&#x8111;&#x5C31;&#x6559;&#x4ED6;&#x4EEC;&#x73A9;&#x6E38;&#x620F;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x5C31;&#x662F;&#x73A9;&#x90A3;&#x4E2A;09&#x5E74;&#x5F88;&#x706B;&#x7684;&#x6E38;&#x620F;&#x300A;&#x690D;&#x7269;&#x5927;&#x6218;&#x50F5;&#x5C38;&#x300B;&#xFF0C;&#x8FD8;&#x522B;&#x8BF4;&#x4ED6;&#x4EEC;&#x7684;&#x609F;&#x6027;&#x8FD8;&#x771F;&#x9AD8;&#x554A;&#xFF01;&#x4E00;&#x4E2A;&#x661F;&#x671F;&#x540E;&#xFF0C;&#x628A;&#x6240;&#x6709;&#x7684;&#x5173;&#x5361;&#x6253;&#x8FC7;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E2D;&#x9014;&#x6211;&#x4E5F;&#x63D0;&#x793A;&#x4E86;&#x5F88;&#x591A;&#x6E38;&#x620F;&#x5173;&#x952E;&#x7684;&#x79D8;&#x7C4D;&#xFF0C;&#x8BB0;&#x5F97;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x4ED6;&#x4EEC;&#x65E9;&#x4E0A;5&#x70B9;&#x949F;&#x4E00;&#x9192;&#xFF0C;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x6253;&#x5F00;&#x7535;&#x8111;&#xFF0C;&#x6E38;&#x620F;&#x73A9;&#x8D77;&#xFF01;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#x6211;&#x8FD8;&#x5728;&#x7761;&#x89C9;&#xFF0C;&#x4E00;&#x4E2A;&#x661F;&#x671F;&#x540E;&#xFF0C;&#x4ED6;&#x4EEC;&#x8BF4;&#x90A3;&#x4E2A;&#x6E38;&#x620F;&#x592A;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x53EF;&#x73A9;&#x6027;&#x4E0D;&#x9AD8;&#xFF0C;&#x6211;&#x60F3;&#x4E86;&#x4E0B;&#x4E0D;&#x5982;&#x6559;&#x4ED6;&#x4EEC;&#x73A9;&#x90A3;&#x79CD;&#x5373;&#x65F6;&#x6218;&#x4E89;&#x6E38;&#x620F;&#xFF0C;&#x6211;&#x6253;&#x5F00;&#x300A;&#x9B54;&#x517D;&#x4E89;&#x9738;&#x300B;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x770B;&#x4E0D;&#x61C2;&#xFF0C;&#x6211;&#x60F3;&#x4E86;&#x4E0B;&#x540E;&#x6765;&#x6362;&#x6210;&#x4E86;&#x300A;&#x7EA2;&#x8B66;&#x300B;&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#x8205;&#x8205;&#x5BF9;&#x90A3;&#x4E2A;&#x6E38;&#x620F;&#x975E;&#x5E38;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4F30;&#x8BA1;&#x4ED6;&#x4EEC;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x770B;&#x6253;&#x4ED7;&#x7684;&#x7535;&#x89C6;&#x770B;&#x591A;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x9020;&#x8B66;&#x72AC;&#x3001;&#x4EBA;&#x6C11;&#x89E3;&#x653E;&#x519B;&#x3001;&#x5766;&#x514B;&#x3001;&#x9ED1;&#x9E70;&#x6218;&#x6597;&#x673A;&#xFF0C;&#x5076;&#x5C14;&#x4F1A;&#x95EE;&#x6211;&#x4E00;&#x4E9B;&#x6781;&#x5176;&#x5F31;&#x667A;&#x7684;&#x95EE;&#x9898;&#x3002;&#x663E;&#x7136;&#x4ED6;&#x4EEC;&#x89C9;&#x5F97;&#x7535;&#x8111;&#x662F;&#x4E2A;&#x597D;&#x4E1C;&#x897F;&#xFF01;&#x7136;&#x540E;&#x4ED6;&#x4EEC;&#x7EA0;&#x7ED3;&#x7740;&#x4EE5;&#x540E;&#x662F;&#x4E70;&#x53F0;&#x5F0F;&#x8FD8;&#x662F;&#x7B14;&#x8BB0;&#x672C;&#xFF1F;&#x6211;&#x60F3;&#x4E5F;&#x662F;&#x6BD5;&#x7ADF;&#x6211;&#x5B66;&#x8FD9;&#x4E2A;&#x4E13;&#x4E1A;&#xFF0C;&#x8BA9;&#x4ED6;&#x4EEC;&#x4E5F;&#x591A;&#x63A5;&#x89E6;&#x4E0B;&#xFF0C;&#x8FD9;&#x6837;&#x4E5F;&#x633A;&#x597D;&#x7684;&#x554A;&#xFF01;</p>
<p>&#x63A5;&#x7740;&#x5C31;&#x662F;&#x627E;&#x5DE5;&#x4F5C;&#x4E86;&#xFF0C;&#x6211;&#x5728;&#x7F51;&#x4E0A;&#x53D1;&#x4E86;&#x51E0;&#x4EFD;&#x7B80;&#x5386;&#xFF0C;&#x5728;&#x53D1;&#x7B80;&#x5386;&#x4E4B;&#x524D;&#x6211;&#x53C2;&#x8003;&#x8FC7;&#x5F88;&#x591A;&#x4EBA;&#xFF0C;&#x7ED3;&#x679C;&#x5F88;&#x5FEB;&#x5C31;&#x6709;&#x516C;&#x53F8;&#x901A;&#x77E5;&#x9762;&#x8BD5;&#xFF0C;&#x8BB0;&#x5F97;&#x90A3;&#x5929;&#x662F;&#x661F;&#x671F;&#x4E94;&#x6211;&#x9762;&#x8BD5;&#x7684;&#x7B2C;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x6566;&#x714C;&#x7F51;&#xFF0C;&#x90A3;&#x4E2A;&#x516C;&#x53F8;&#x662F;OA&#x8F6F;&#x4EF6;&#x548C;B2C&#x7535;&#x5B50;&#x5546;&#x52A1;&#x5E73;&#x53F0;&#xFF0C;&#x5BF9;&#x5404;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x8981;&#x6C42;&#x90FD;&#x5F88;&#x9AD8;&#x3002;&#x63A5;&#x7740;&#x4ED6;&#x4EEC;&#x7684;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x89C1;&#x5230;&#x6211;&#xFF0C;&#x7136;&#x540E;&#x8BF4;&#x8FD9;&#x91CC;&#x6709;&#x4E2A;&#x8BD5;&#x673A;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x505A;&#x51FA;&#x6765;&#x4E86;&#x6211;&#x5C31;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x6211;&#x8FC7;&#x53BB;&#x770B;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x7A0B;&#x5E8F;&#x9898;&#xFF0C;&#x8BB0;&#x5F97;&#x7B2C;&#x4E00;&#x4E2A;&#x9898;&#x76EE;&#x662F;&#x68C0;&#x7D22;&#x5B57;&#x7B26;&#x4E32;&#x91CD;&#x590D;&#x7684;&#x9879;&#xFF0C;&#x5E76;&#x4E14;&#x53BB;&#x6389;&#x91CD;&#x590D;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x9898;&#x662F;&#x4E24;&#x4E2A;&#x65E0;&#x5E8F;&#x5217;&#x7684;&#x6570;&#x7EC4;&#x5408;&#x5E76;&#x5230;&#x4E00;&#x4E2A;&#x6709;&#x5E8F;&#x7684;&#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x5927;&#x5B66;&#x91CC;&#x9762;&#x300A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x300B;&#x4E2D;&#x7684;&#x7B97;&#x6CD5;&#x4E86;&#xFF0C;&#x95EE;&#x9898;&#x4E0D;&#x5927;&#x6211;&#x5F53;&#x7136;&#x662F;&#x628A;&#x8FD9;&#x4E24;&#x4E2A;&#x9898;&#x76EE;&#x89E3;&#x51B3;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x90A3;&#x4E2A;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x95EE;&#x6211;&#x4E0B;&#x5348;&#x6709;&#x6CA1;&#x6709;&#x7A7A;&#xFF1F;&#x6211;&#x5FC3;&#x91CC;&#x60F3;&#x7740;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x770B;&#x4ED6;&#x662F;&#x4E0D;&#x662F;&#x53C8;&#x8981;&#x800D;&#x4EC0;&#x4E48;&#x82B1;&#x6837;&#xFF0C;&#x5C31;&#x8BF4;&#x6709;&#x7A7A;&#xFF0C;&#x8FD9;&#x4E0B;&#x53EF;&#x597D;&#x4E86;&#xFF0C;&#x4ED6;&#x4E34;&#x65F6;&#x6574;&#x4E86;&#x5230;&#x6570;&#x636E;&#x5E93;&#x7684;&#x9898;&#x76EE;&#xFF0C;&#x8BF4;&#x771F;&#x7684;&#x90A3;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x9898;&#x76EE;&#x5199;&#x5F97;&#x5F88;&#x662F;&#x62BD;&#x8C61;&#x5F88;&#x662F;&#x542B;&#x7CCA;&#xFF0C;&#x6211;&#x5FC3;&#x60F3;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x8003;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x67E5;&#x8BE2;&#x3001;&#x5206;&#x7EC4;&#x67E5;&#x8BE2;&#x3001;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#xFF08;&#x5206;&#x9875;&#xFF09;&#xFF0C;&#x7ED3;&#x679C;&#x6211;&#x8FD8;&#x662F;&#x62FF;&#x4E0B;&#x4E86;&#xFF0C;&#x8FD9;&#x4E0B;&#x53EF;&#x597D;&#x4ED6;&#x53C8;&#x5C45;&#x7136;&#x6311;&#x6BDB;&#x75C5;&#x4E86;&#xFF0C;&#x8BF4;&#x5144;&#x5F1F;&#x4F60;&#x6570;&#x636E;&#x5E93;&#x8FD9;&#x5757;&#x6709;&#x70B9;&#x513F;&#x8584;&#x5F31;&#xFF0C;&#x56DE;&#x53BB;&#x591A;&#x770B;&#x770B;&#x4E66;&#xFF0C;&#x4E0B;&#x4E2A;&#x661F;&#x671F;&#x4E8C;&#x8FC7;&#x6765;&#x590D;&#x8BD5;&#xFF0C;&#x4ED6;&#x63D0;&#x793A;&#x4F1A;&#x8003;&#x6211;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x56DE;&#x53BB;&#x523B;&#x82E6;&#x5B66;&#x4E60;&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x6574;&#x5929;&#x90FD;&#x6CA1;&#x6709;&#x7761;&#x89C9;&#x56DE;&#x987E;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x5305;&#x62EC;ADO.NET&#x3002;&#x7EC8;&#x4E8E;&#x76FC;&#x5230;&#x4E86;&#x4E0B;&#x4E2A;&#x661F;&#x671F;&#x4E8C;&#xFF0C;&#x4E0A;&#x5348;10&#x70B9;&#x949F;&#xFF0C;&#x590D;&#x8BD5;&#x7684;&#x5934;&#x4E00;&#x4E2A;&#x665A;&#x4E0A;&#x6211;&#x51E0;&#x4E4E;&#x8981;&#x5931;&#x7720;&#x4E86;&#xFF0C;&#x8111;&#x6D77;&#x4E2D;&#x6D6E;&#x73B0;&#x6211;&#x7EC8;&#x4E8E;&#x505A;&#x4E0A;&#x4E86;&#x8D44;&#x683C;&#x7A0B;&#x5E8F;&#x4E86;&#xFF0C;&#x8981;&#x52AA;&#x529B;&#xFF0C;&#x8981;&#x52A0;&#x6CB9;&#xFF0C;&#x6211;&#x4E00;&#x5B9A;&#x80FD;&#x884C;&#xFF01;&#x590D;&#x8BD5;&#x5FC5;&#x80DC;&#xFF01;&#x63A5;&#x7740;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x89C1;&#x5230;&#x6211;&#xFF0C;&#x5C45;&#x7136;&#x6CA1;&#x6709;&#x8BA9;&#x6211;&#x53BB;&#x8BD5;&#x673A;&#x8003;&#x8BD5;&#xFF0C;&#x5C31;&#x662F;&#x95EE;&#x6211;&#x4E00;&#x4E2A;&#x4E09;&#x8868;&#x8054;&#x67E5;&#x7684;&#x8BED;&#x53E5;&#xFF0C;&#x8BA9;&#x6211;&#x53E3;&#x5934;&#x9610;&#x8FF0;&#xFF0C;&#x8FD9;&#x4E2A;&#x683C;&#x5F0F;&#x6211;&#x6839;&#x672C;&#x5C31;&#x8BB0;&#x5F97;&#x4E0D;&#x662F;&#x592A;&#x6E05;&#x6670;&#xFF0C;&#x4F46;&#x662F;&#x53C8;&#x4E00;&#x70B9;&#x53EA;&#x6709;&#x7535;&#x8111;&#x6709;&#x7F51;&#x7EBF;&#xFF0C;&#x6211;&#x7EDD;&#x5BF9;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x5927;&#x81F4;&#x8BF4;&#x4E86;&#x4E0B;select * from a,b,c where &#x2026;.,&#x7ED3;&#x679C;&#x4ED6;&#x8BF4;&#x5144;&#x5F1F;&#x4F60;&#x6570;&#x636E;&#x8FD9;&#x5757;&#x6709;&#x70B9;&#x513F;&#x8584;&#x5F31;&#xFF0C;&#x4ED6;&#x53C8;&#x95EE;&#x4F60;&#x77E5;&#x9053;&#x59D4;&#x6258;&#x3001;&#x4E8B;&#x4EF6;&#x3001;&#x53CD;&#x5C04;&#x548C;&#x5E8F;&#x5217;&#x5316;&#x5417;&#xFF1F;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;.netframework&#x4E2D;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x5FC3;&#x91CC;&#x6697;&#x60F3;&#x8BF4;&#x597D;&#x8003;&#x6570;&#x636E;&#x5E93;&#x7684;&#xFF0C;&#x600E;&#x4E48;&#x53C8;&#x95EE;&#x8D77;&#x4E86;&#x7A0B;&#x5E8F;&#xFF1F;&#x6211;&#x5C31;&#x8BB2;&#x4E86;&#x4E0B;&#x6211;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x5176;&#x5B9E;&#x4E4B;&#x524D;&#x6211;&#x5F88;&#x5C11;&#x7528;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x6240;&#x4EE5;&#x8BB2;&#x7684;&#x5F53;&#x7136;&#x4E0D;&#x591F;&#x4E13;&#x4E1A;&#xFF0C;&#x6700;&#x7EC8;&#x88AB;&#x4ED6;&#x6253;&#x53D1;&#x8D70;&#x4E86;&#xFF0C;&#x590D;&#x8BD5;&#x5931;&#x8D25;&#xFF01;&#x6211;&#x8D70;&#x51FA;&#x4E86;&#x90A3;&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x7ED9;&#x6211;&#x5988;&#x6253;&#x4E86;&#x4E2A;&#x7535;&#x8BDD;&#xFF0C;&#x8BE6;&#x7EC6;&#x5C06;&#x4E86;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x7684;&#x524D;&#x540E;&#x7ECF;&#x8FC7;&#xFF0C;&#x6211;&#x5988;&#x8BF4;&#xFF1A;&#x201C;&#x6CA1;&#x4E8B;&#xFF0C;&#x6162;&#x6162;&#x6765;&#xFF01;&#x591A;&#x603B;&#x7ED3;&#x4E0B;&#xFF01;&#x201D;&#xFF0C;&#x7136;&#x540E;&#x90A3;&#x5929;&#x4E0B;&#x5348;&#x6211;&#x5988;&#x53C8;&#x7ED9;&#x6211;&#x56DE;&#x4E86;&#x4E2A;&#x7535;&#x8BDD;&#x8BF4;&#xFF1A;&#x201C;&#x5B69;&#x5B50;&#xFF0C;&#x6211;&#x56DE;&#x53BB;&#x60F3;&#x4E86;&#x89C9;&#x5F97;&#x9762;&#x8BD5;&#x4F60;&#x7684;&#x90A3;&#x4E2A;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x4F30;&#x8BA1;&#x4E0D;&#x662F;&#x8BDA;&#x5FC3;&#x7684;&#x3002;&#x201D;&#xFF0C;&#x5F53;&#x65F6;&#x6211;&#x5F88;&#x662F;&#x751F;&#x6C14;&#xFF0C;&#x201C;&#x600E;&#x4E48;&#x4E0D;&#x8BDA;&#x5FC3;&#xFF0C;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x539F;&#x56E0;&#xFF01;&#x4E0D;&#x8981;&#x627E;&#x501F;&#x53E3;&#x4E86;&#xFF01;&#x201D;&#xFF0C;&#x63A5;&#x7740;&#x7ED9;&#x6211;&#x8205;&#x8205;&#x6253;&#x4E86;&#x4E2A;&#x7535;&#x8BDD;&#xFF1A;&#x201C;&#x6211;&#x590D;&#x8BD5;&#x5931;&#x8D25;&#x4E86;&#x201D;&#xFF0C;&#x4ED6;&#x4E5F;&#x529D;&#x6211;&#xFF1A;&#x201C;&#x6CA1;&#x4E8B;&#xFF01;&#x6BD5;&#x7ADF;&#x53EA;&#x9762;&#x8BD5;&#x4E86;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#xFF01;&#x4E0D;&#x7528;&#x6025;&#xFF01;&#x201D;&#xFF0C;&#x6211;&#x5FC3;&#x91CC;&#x4E5F;&#x662F;&#x8FD9;&#x4E48;&#x60F3;&#x7684;&#x3002;</p>
<p>&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x6211;&#x4E00;&#x76F4;&#x4F4F;&#x5728;&#x6DF1;&#x5733;&#x7684;&#x5173;&#x5185;&#xFF0C;&#x5728;&#x65C5;&#x793E;&#x4F4F;&#x4E86;&#x4E00;&#x4E2A;&#x661F;&#x671F;&#xFF0C;&#x63A5;&#x7740;&#x7B2C;&#x4E00;&#x6B21;&#x590D;&#x8BD5;&#x7684;&#x5931;&#x8D25;&#xFF0C;&#x6211;&#x8BE5;&#x597D;&#x597D;&#x56DE;&#x53BB;&#x770B;&#x770B;&#x4E66;&#x4E86;&#xFF0C;&#x770B;&#x770B;&#x9762;&#x8BD5;&#x9898;&#x3001;&#x7B14;&#x8BD5;&#x9898;&#x548C;&#x8BD5;&#x673A;&#x9898;&#xFF0C;&#x90A3;&#x5929;&#x4E0B;&#x5348;&#x505A;&#x7740;&#x8F66;&#x5230;&#x4E1C;&#x839E;&#x957F;&#x5B89;&#x8205;&#x8205;&#x5BB6;&#xFF0C;&#x5230;&#x90A3;&#x513F;&#x5DF2;&#x7ECF;&#x662F;&#x4E0B;&#x5348;7&#x70B9;&#x591A;&#x4E86;&#xFF0C;&#x8205;&#x5988;&#x4F9D;&#x65E7;&#x6574;&#x4E86;&#x4E00;&#x5927;&#x684C;&#x597D;&#x83DC;&#xFF0C;&#x8205;&#x8205;&#x62FF;&#x7740;&#x4E24;&#x74F6;&#x8001;&#x9752;&#x5C9B;&#xFF0C;&#x5B89;&#x629A;&#x6211;&#x53D7;&#x632B;&#x7684;&#x5FC3;&#x7075;&#x3002;&#x996D;&#x684C;&#x95F4;&#x4ED6;&#x4EEC;&#x7ED9;&#x6211;&#x8BB2;&#x4E86;&#x597D;&#x591A;&#x793E;&#x4F1A;&#x4E0A;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x6211;&#x603B;&#x7ED3;&#x4E86;&#x4E0B;&#x7B2C;&#x4E00;&#x6B21;&#x9762;&#x8BD5;&#x7684;&#x7ECF;&#x5386;&#x3002;&#x5230;&#x73B0;&#x5728;&#x60F3;&#x8D77;&#x6765;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x90A3;&#x4E2A;&#x516C;&#x53F8;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x662F;&#x8BDA;&#x5FC3;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x5FC3;&#x60F3;&#x6BD4;&#x6211;&#x4F18;&#x79C0;&#x7684;&#x4EBA;&#x591A;&#x4E86;&#x53BB;&#xFF0C;&#x4F60;&#x4E5F;&#x53EA;&#x662F;&#x4E2A;&#x5927;&#x4E13;&#x6587;&#x51ED;&#xFF0C;&#x540E;&#x9762;&#x8FD8;&#x6709;&#x4E00;&#x5806;&#x4EBA;&#x7B49;&#x7740;&#x8FD9;&#x4E2A;&#x5C97;&#x4F4D;&#x3002;&#x81F3;&#x4ECA;&#x90FD;&#x8FD8;&#x8BB0;&#x5F97;&#x53BB;&#x90A3;&#x4E2A;&#x516C;&#x53F8;&#x9762;&#x8BD5;&#x3001;&#x590D;&#x8BD5;&#x7684;&#x60C5;&#x666F;&#xFF0C;&#x6211;&#x5B66;&#x4E60;&#x4E86;&#xFF01;</p>
<p>&#x5230;&#x540E;&#x6765;&#x53EA;&#x5230;&#x73B0;&#x5728;&#x6211;&#x4E00;&#x76F4;&#x4F4F;&#x5728;&#x6211;&#x8868;&#x54E5;&#x8FD9;&#x91CC;&#xFF0C;&#x7D2F;&#x8BA1;&#x9762;&#x8BD5;&#x4E86;&#x5FEB;20&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x6BCF;&#x5929;&#x6324;&#x516C;&#x4EA4;&#xFF0C;&#x5728;&#x516C;&#x4EA4;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x6BCF;&#x5929;&#x5C31;&#x8981;&#x82B1;5&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x540E;&#x6765;&#x9762;&#x8BD5;&#x7684;&#x516C;&#x53F8;&#x4E5F;&#x6709;&#x5F88;&#x641E;&#x7B11;&#x7684;&#xFF0C;&#x8BB0;&#x5F97;&#x6709;&#x4E2A;&#x516C;&#x53F8;&#x9762;&#x8BD5;&#x6211;&#x7684;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x8BF4;&#xFF1A;&#x201C;&#x770B;&#x6765;&#x4F60;&#x7684;&#x6280;&#x672F;&#x5B66;&#x5F97;&#x6BD4;&#x6211;&#x597D;&#x554A;&#xFF01;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x80FD;&#x6765;&#x4E0A;&#x73ED;&#xFF1F;&#x201D;&#xFF0C;&#x6211;&#x4E00;&#x770B;&#x5C31;&#x6CA1;&#x6709;&#x620F;&#x4E86;&#xFF0C;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x5C31;&#x90A3;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x516C;&#x53F8;&#x6211;&#x662F;&#x4E0D;&#x4F1A;&#x53BB;&#x4E86;&#xFF1B;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x9762;&#x8BD5;&#x6211;&#x7684;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x8BF4;&#xFF1A;&#x201C;&#x8BA9;&#x6211;&#x628A;ASP.NET&#x7684;&#x539F;&#x7406;&#x8BF4;&#x4E00;&#x904D;&#xFF0C;&#x8BF8;&#x5982;GET&#xFF0C;POST&#x8BF7;&#x6C42;&#x65B9;&#x5F0F;&#x201D;&#xFF0C;&#x6211;&#x4EE5;&#x524D;&#x662F;&#x53EA;&#x7BA1;&#x7528;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x539F;&#x7406;&#x6027;&#x7684;&#x4E1C;&#x897F;&#x8BB2;&#x4E0D;&#x597D;&#xFF0C;&#x7ED3;&#x679C;&#x6CA1;&#x6709;&#x620F;&#x4E86;&#xFF0C;&#x8D70;&#x7684;&#x65F6;&#x5019;&#x90A3;&#x4E2A;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x8BF4;&#xFF1A;&#x201C;&#x6211;&#x529D;&#x4F60;&#x56DE;&#x53BB;&#x628A;&#x90A3;&#x4E2A;&#x4E66;&#x597D;&#x597D;&#x770B;&#x770B;&#xFF0C;&#x518D;&#x51FA;&#x6765;&#x9762;&#x8BD5;&#x201D;&#xFF0C;&#x6211;&#x8BF4;&#xFF1A;&#x201C;&#x80FD;&#x5426;&#x8BA9;&#x6211;&#x505A;&#x8BD5;&#x673A;&#x9898;&#x201D;&#xFF0C;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x6574;&#x4E00;&#x53E5;&#xFF1A;&#x201C;&#x9762;&#x8BD5;&#x90FD;&#x6CA1;&#x6709;&#x8FC7;&#xFF0C;&#x8BD5;&#x673A;&#x9898;&#x4F60;&#x6CA1;&#x8D44;&#x683C;&#x201D;&#x3002;&#x53C8;PASS&#x4E86;&#xFF01;</p>
<p>&#x6700;&#x7EC8;&#x6211;&#x8FD8;&#x662F;&#x8FDB;&#x4E86;&#x4E00;&#x5BB6;&#x5C0F;&#x578B;&#x7684;&#x7F51;&#x7EDC;&#x516C;&#x53F8;&#xFF0C;&#x4E3B;&#x8981;&#x6280;&#x672F;ASP.NET&#x642D;&#x5EFA;B2C&#x3001;B2B&#x7F51;&#x7AD9;&#x5E73;&#x53F0;&#xFF0C;&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#x4EE5;&#x524D;&#x6CA1;&#x6709;&#x63A5;&#x89E6;&#xFF0C;&#x73B0;&#x5728;&#x6B63;&#x5728;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x4ECA;&#x5929;&#x628A;&#x516C;&#x53F8;&#x91CC;&#x7684;&#x8FD9;&#x4E2A;&#x6E90;&#x7801;&#x6574;&#x8FD9;&#x5728;&#x770B;&#xFF0C;&#x5148;&#x7406;&#x6E05;&#x8FD9;&#x4E2A;&#x5E73;&#x53F0;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x7136;&#x540E;&#x8BD5;&#x7740;&#x505A;&#x8FD9;&#x4E9B;&#x9879;&#x76EE;&#xFF01;&#x6240;&#x4EE5;&#x5FC5;&#x987B;&#x52AA;&#x529B;&#xFF01;&#x52A0;&#x6CB9;&#xFF01;</p>
<p>&#x7279;&#x6B64;&#xFF0C;&#x4E5F;&#x795D;&#x613F;&#x5927;&#x5B66;401&#x5168;&#x4F53;&#x5144;&#x5F1F;&#x5FC3;&#x60F3;&#x4E8B;&#x6210;&#xFF01;&#x4E8B;&#x4E1A;&#x98DE;&#x9EC4;&#x817E;&#x8FBE;&#xFF01;&#x7231;&#x60C5;&#x751C;&#x871C;&#x871C;&#xFF01;&#x4E5F;&#x6DF1;&#x8868;&#x6B49;&#x610F;&#xFF0C;6&#x6708;&#x4E2D;&#x65EC;&#x4E0D;&#x56DE;&#x53BB;&#x62FF;&#x6BD5;&#x4E1A;&#x8BC1;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x8DDF;&#x54E5;&#x51E0;&#x4E2A;&#x4E00;&#x8D77;&#x559D;&#x9152;&#x4E86;&#xFF01;&#x4F46;&#x662F;&#x6211;&#x6C38;&#x8FDC;&#x4F1A;&#x8BB0;&#x5F97;&#x4F60;&#x4EEC;&#x7684;&#xFF01;</p>
<p>&#x65F6;&#x95F4;&#x4E5F;&#x4E0D;&#x65E9;&#x4E86;&#xFF0C;&#x5FEB;&#x5230;&#x51CC;&#x6668;3&#x70B9;&#x4E86;&#xFF0C;&#x5173;&#x673A;&#xFF0C;&#x5173;&#x706F;&#xFF0C;&#x7761;&#x89C9;&#x4E86;&#xFF01;</p>

      

      
        
    </div>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2015/01/13/cmd-markdown-test/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          Markdown学习
        
      </div>
    </a>
  
  
    <a href="/2010/08/19/see-dongguan/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">侃侃--东莞</div>
    </a>
  
</nav>

  
</article>


<section id="comments">
  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="post-see-shenzhen" data-title="侃侃--深圳" data-url="http://everyding.github.io/2011/05/29/see-shenzhen/" data-limit="50"></div>
  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
    var duoshuoQuery = {short_name:'eval'};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>
  <!-- 多说公共JS代码 end -->
</section>
</section>
        <aside id="sidebar">
  <nav class="menus">
  	<ul>
  		<li><a href="/"><i class="icon icon-home"></i></a></li>
  		
			<li><a href="/archives"><i class="icon icon-fenlei"></i></a></li>
  		
  		
			<li><a href="/tags"><i class="icon icon-tag"></i></a></li>
  		
  		
  			<li><a href="https://github.com/everyding" target="_blank"><i class="icon icon-github"></i></a></li>
  		
  	</ul>
  </nav>
  <a id="go-top" href="#"><i class="icon icon-up"></i></a>
</aside>
      </div>
      <footer id="footer">
  
	<div id="footer-info" class="inner">
	  &copy; 2019 eval 
	  - Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
	  - Theme <a href="https://github.com/Alex-fun/hexo-theme-jane/" target="_blank">Jane</a>
	</div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/tags" class="mobile-nav-link">Tag</a>
  
    <a href="https://github.com/everyding" class="mobile-nav-link">Github</a>
  
</nav>
    

<script src="//cdn.bootcss.com/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>