<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
  <meta charset="utf-8">
  
  <title>侃侃--结局 | eval&#39;s blog</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x3010;warning&amp;#xFF1A;&amp;#x672C;&amp;#x54C1;&amp;#x672A;&amp;#x6210;&amp;#x5E74;&amp;#x4EBA;&amp;#x8BF7;&amp;#x5728;&amp;#x7236;&amp;#x6BCD;&amp;#x966A;&amp;#x540C;&amp;#x4E0B;&amp;#x89C2;&amp;#x770B;&amp;#xFF0C;&amp;#x7531;&amp;#x4E8E;&amp;#x53EF;&amp;#x80FD;&amp;#x6D89;&amp;#x53CA;*">
<meta name="keywords" content="侃侃 北京">
<meta property="og:type" content="article">
<meta property="og:title" content="侃侃--结局">
<meta property="og:url" content="http://everyding.github.io/2015/12/17/see-end/index.html">
<meta property="og:site_name" content="eval&#39;s blog">
<meta property="og:description" content="&amp;#x3010;warning&amp;#xFF1A;&amp;#x672C;&amp;#x54C1;&amp;#x672A;&amp;#x6210;&amp;#x5E74;&amp;#x4EBA;&amp;#x8BF7;&amp;#x5728;&amp;#x7236;&amp;#x6BCD;&amp;#x966A;&amp;#x540C;&amp;#x4E0B;&amp;#x89C2;&amp;#x770B;&amp;#xFF0C;&amp;#x7531;&amp;#x4E8E;&amp;#x53EF;&amp;#x80FD;&amp;#x6D89;&amp;#x53CA;*">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="http://everyding.github.io/2015/12/17/see-end/1.jpg">
<meta property="og:image" content="http://everyding.github.io/2015/12/17/see-end/2.jpg">
<meta property="og:image" content="http://everyding.github.io/2015/12/17/see-end/3.jpg">
<meta property="og:image" content="http://everyding.github.io/2015/12/17/see-end/4.jpg">
<meta property="og:image" content="http://everyding.github.io/2015/12/17/see-end/5.jpg">
<meta property="og:updated_time" content="2019-03-07T06:52:28.473Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="侃侃--结局">
<meta name="twitter:description" content="&amp;#x3010;warning&amp;#xFF1A;&amp;#x672C;&amp;#x54C1;&amp;#x672A;&amp;#x6210;&amp;#x5E74;&amp;#x4EBA;&amp;#x8BF7;&amp;#x5728;&amp;#x7236;&amp;#x6BCD;&amp;#x966A;&amp;#x540C;&amp;#x4E0B;&amp;#x89C2;&amp;#x770B;&amp;#xFF0C;&amp;#x7531;&amp;#x4E8E;&amp;#x53EF;&amp;#x80FD;&amp;#x6D89;&amp;#x53CA;*">
<meta name="twitter:image" content="http://everyding.github.io/2015/12/17/see-end/1.jpg">
  
    <link rel="alternative" href="/atom.xml" title="eval&#39;s blog" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.ico">
  
  <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  <link rel="stylesheet" href="/css/style.css">
  

</head></html>
<body>
  <div id="container">
    <div id="wrap">
      <div class="outer">
        <section id="main"><article id="post-see-end" class="article article-type-post" itemscope itemprop="blogPost">
  
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      侃侃--结局
    </h1>
  

      </header>
    
    <div class="article-meta">
      <a href="/2015/12/17/see-end/" class="article-date">
  <time datetime="2015-12-17T05:50:08.000Z" itemprop="datePublished">2015-12-17 13:50:08</time>
</a>
      
    </div>
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x3010;warning&#xFF1A;&#x672C;&#x54C1;&#x672A;&#x6210;&#x5E74;&#x4EBA;&#x8BF7;&#x5728;&#x7236;&#x6BCD;&#x966A;&#x540C;&#x4E0B;&#x89C2;&#x770B;&#xFF0C;&#x7531;&#x4E8E;&#x53EF;&#x80FD;&#x6D89;&#x53CA;**&#x5185;&#x5BB9;&#x5E26;&#x6765;&#x4E0D;&#x826F;&#x5F71;&#x54CD;&#x672C;&#x4EBA;&#x6982;&#x4E0D;&#x8D1F;&#x8D23;&#x3002;&#x53E6;&#xFF1A;&#x624B;&#x673A;&#x7528;&#x6237;&#x614E;&#x5165;&#xFF0C;&#x571F;&#x8C6A;&#x8BF7;&#x65E0;&#x89C6;&#xFF01;&#x672C;&#x6545;&#x4E8B;&#x7EAF;&#x5C5E;&#x771F;&#x5B9E;&#xFF01;&#x3011;</p>
<p>&#x3010;&#x5E8F;&#x3011;</p>
<p>&#x8DDD;&#x4E0A;&#x6B21;&#x65E5;&#x5FD7;&#x66F4;&#x65B0;&#x5DF2;&#x7ECF;&#x6709;4&#x5E74;&#x591A;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x4EE3;&#x4EBA;&#x79BB;&#x4E0D;&#x5F00;&#x7F51;&#x7EDC;&#xFF0C;&#x7279;&#x522B;&#x662F;80&#x3001;90&#x540E;&#xFF0C;&#x50CF;&#x5F53;&#x521D;&#x61F5;&#x61C2;&#x65F6;&#x671F;&#x5927;&#x5BB6;&#x90FD;&#x7231;&#x73A9;QQZone&#xFF0C;&#x53EF;&#x662F;&#x5047;&#x5982;&#x73B0;&#x5728;&#x7528;&#x5B83;&#x5199;&#x70B9;&#x513F;&#x4E1C;&#x897F;&#xFF0C;&#x53EF;&#x80FD;&#x5927;&#x5BB6;&#x90FD;&#x89C9;&#x5F97;&#x77EB;&#x60C5;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728;&#x6B64;&#x58F0;&#x660E;po&#x4E3B;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x6D53;&#x539A;&#x60C5;&#x6000;&#x7684;&#x4EBA;&#xFF0C;&#x4E5F;&#x8BA9;&#x4F83;&#x4F83;&#x7BC7;&#x5E8F;&#x5217;&#x6587;&#x7AE0;&#x753B;&#x4E0A;&#x4E00;&#x4E2A;&#x5706;&#x6EE1;&#x7684;&#x53E5;&#x53F7;&#x3002;</p>
<p>&#x3010;&#x63A8;&#x8350;&#x6B4C;&#x66F2;&#x3011;</p>
<p>1.&#x300A;&#x8BB2;&#x4E0D;&#x51FA;&#x518D;&#x89C1;&#x300B;&#xFF08;&#x8BE5;&#x66F2;&#x76EE;&#x5728;&#x5F20;&#x65E5;&#x5929;&#xFF08;&#x8001;&#x56DB;&#xFF09;&#x7684;&#x8F66;&#x8F7D;CD&#x4E2D;&#x65E0;&#x610F;&#x542C;&#x5230;&#x7684;&#xFF0C;&#x662F;&#x5728;2013&#x5E74;&#x5927;&#x9189;&#x4E00;&#x573A;&#x56DE;&#x6C49;&#x53E3;&#x9014;&#x4E2D;&#xFF0C;&#x8FD4;&#x4EAC;&#x540E;&#x627E;&#x4E86;&#x6574;&#x6574;&#x4E00;&#x5929;&#x624D;&#x627E;&#x5230;&#x6B4C;&#x540D;&#xFF0C;&#x8C2D;&#x6821;&#x957F;&#x7684;&#xFF09;<br>2.&#x300A;Whataya Want From Me&#x300B; &#x2013; Adam Lambert<br>3.&#x300A;The Catalyst&#x300B; &#x2013; Linkin Park&#xFF08;po&#x4E3B;&#x5E1D;&#x90FD;&#x89C1;&#x8BC1;Linkin Park&#x7CBE;&#x5F69;&#x6F14;&#x7ECE;&#xFF0C;&#x4ED6;&#x7684;&#x597D;&#x6B4C;&#x592A;&#x591A;&#xFF0C;&#x73A9;PC Game&#x5BF9;&#x4ED6;&#x662F;&#x5F88;&#x4E86;&#x89E3;&#xFF0C;&#x5C31;&#x4E0D;&#x7528;&#x63D0;In The End&#x3001;Numb&#x2026;&#xFF09;<br>4.&#x300A;&#x591C;&#x7A7A;&#x4E2D;&#x6700;&#x4EAE;&#x7684;&#x661F;&#x300B;&#x3001;&#x300A;1987&#x6211;&#x4E0D;&#x77E5;&#x4F1A;&#x9047;&#x89C1;&#x4F60;&#x300B;&#xFF08;&#x8FD9;&#x7B97;&#x5F97;&#x4E0A;&#x5F53;&#x4E0B;&#x6BD4;&#x8F83;&#x4F18;&#x79C0;&#x7684;&#x4E2D;&#x6587;&#x6B4C;&#x66F2;&#x4E86;&#xFF0C;&#x81F3;&#x5C11;po&#x4E3B;&#x8FD9;&#x6837;&#x8BA4;&#x4E3A;&#xFF09;<br>5.&#x300A;&#x4E00;&#x751F;&#x6240;&#x7231;&#x300B;&#xFF08;&#x5927;&#x8BDD;&#x897F;&#x6E38;&#x5171;&#x770B;&#x4E86;3-5&#x904D;&#xFF0C;&#x4E5F;&#x5C31;&#x8BB0;&#x4E0B;&#x4E86;&#xFF09;<br>&#x8BF4;&#x660E;&#xFF1A;&#x8FD9;&#x4E9B;&#x53EF;&#x80FD;&#x4E0D;&#x9002;&#x5408;&#x5EB7;&#x65E5;&#x5929;&#xFF08;&#x8001;&#x5927;&#xFF09;&#x300A;&#x4F60;&#x7684;&#x627F;&#x8BFA;&#x300B;&#xFF08;&#x7CA4;&#x8BED;&#x7248;&#x6BD4;&#x8F83;&#x8010;&#x542C;&#xFF09;&#xFF0C;&#x53F6;&#x65E5;&#x72D7;&#xFF08;&#x8001;&#x5E7A;&#xFF09;&#x300A;&#x624B;&#x5FC3;&#x624B;&#x80CC;&#x300B;&#x7B49;&#x98CE;&#x683C;&#xFF0C;&#x8BF7;&#x614E;&#x542C;&#xFF01;&#x5176;&#x5B9E;&#x6731;&#x65E5;&#x5929;&#xFF08;&#x8001;&#x4E94;&#xFF09;&#x63A8;&#x8350;&#x7684;&#x300A;&#x7687;&#x540E;&#x5927;&#x9053;&#x4E1C;&#x300B;&#x8FD8;&#x662F;&#x5F88;&#x4E0D;&#x9519;&#x3002;</p>
<a id="more"></a>
<p>&#x3010;&#x6B63;&#x6587;&#x3011;</p>
<p>2008&#x5E74;&#x53C2;&#x52A0;&#x9AD8;&#x8003;&#xFF0C;&#x540E;&#x5C31;&#x8BFB;&#x4E8E;&#x6E56;&#x804C;&#xFF08;&#x5168;&#x79F0;&#x662F;&#x6E56;&#x5317;&#x804C;&#x4E1A;&#x6280;&#x672F;&#x5B66;&#x9662;&#xFF0C;&#x4E0D;&#x8FC7;po&#x4E3B;&#x519B;&#x8BAD;&#x7684;&#x65F6;&#x5019;&#x7ADF;&#x7136;&#x88AB;&#x6821;&#x9886;&#x5BFC;&#x5FF5;&#x6210;&#x2013;&#x6E56;&#x5317;&#x6280;&#xFF08;&#x5993;&#xFF09;&#x9662;&#xFF09;&#x8BA1;&#x79D1;&#x7CFB;&#xFF08;&#x5168;&#x79F0;&#xFF1A;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x6280;&#x672F;&#x5E94;&#x7528;&#x4E13;&#x4E1A;&#xFF09;&#x73ED;&#x7EA7;0806101&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x4EEC;&#x5C31;&#x8981;&#x95EE;&#x4E86;&#xFF0C;&#x5C31;&#x8BFB;&#x6E56;&#x804C;&#x662F;&#x600E;&#x6837;&#x4E00;&#x79CD;&#x4F53;&#x9A8C;&#xFF1F;&#x9898;&#x4E3B;&#x53EA;&#x60F3;&#x8BF4;&#x9664;&#x4E86;&#x5B66;&#x6821;&#x201D;LJ&#x201C;&#xFF08;&#x5783;&#x573E;&#xFF09;&#x70B9;&#x513F;&#xFF0C;&#x5176;&#x4ED6;&#x90FD;&#x68D2;&#x68D2;&#x54D2;&#x3002;&#x8BB0;&#x5F97;&#x5F20;&#x65E5;&#x5929;&#x5165;&#x5B66;&#x7684;&#x65F6;&#x5019;&#x8FD9;&#x6837;&#x8BF4;&#xFF1A;&#x7B2C;&#x4E00;&#x6B21;&#x770B;&#x5230;&#x8FD9;&#x6240;&#x5927;&#x5B66;&#xFF0C;&#x5C31;&#x60F3;&#x9003;&#xFF0C;&#x6BD4;&#x81EA;&#x4E2A;&#x4E0A;&#x7684;&#x9AD8;&#x4E2D;&#x90FD;LJ&#xFF1B;&#x4F46;&#x53F6;&#x65E5;&#x72D7;&#x4E0D;&#x8FD9;&#x4E48;&#x8BA4;&#x4E3A;&#xFF0C;&#x67D0;&#x65E5;&#x51E0;&#x4E2A;&#x65E5;&#x5929;&#x4E00;&#x8D77;&#x51FA;&#x53BB;&#x4E70;&#x5348;&#x9910;&#xFF0C;&#x7A81;&#x7136;&#x770B;&#x89C1;&#x62A4;&#x7406;&#x7CFB;&#x4E00;&#x4E2A;MM&#xFF08;&#x672C;&#x9662;&#x50E7;&#x5C11;&#x7CA5;&#x591A;&#xFF09; &#xFF0C;&#x8FD9;&#x4E2A;MM&#x5E94;&#x8BE5;&#x7A7F;&#x7684;&#x662F;&#x6761;&#x88D9;&#x5B50;&#xFF08;&#x5728;&#x8001;&#x53F8;&#x673A;&#x535A;&#x548C;&#x5F90;&#x65E5;&#x72D7;&#x770B;&#x6765;&#xFF0C;&#x5E94;&#x8BE5;&#x88AB;&#x53EB;&#x505A;&#x201D;&#x5236;&#x670D;&#x5C24;&#x7269;&#x201C;&#xFF09;&#xFF0C;&#x7ED3;&#x679C;&#x53F6;&#x65E5;&#x72D7;&#x628A;&#x5634;&#x4E2D;&#x6B63;&#x5728;&#x5480;&#x56BC;&#x201D;&#x798F;&#x7530;&#x7092;&#x996D;&#x201C;&#x55B7;&#x4E86;&#x5176;&#x4ED6;&#x65E5;&#x5929;&#x4EEC;&#x4E00;&#x8EAB;&#xFF0C;&#x6211;&#x76EE;&#x6D4B;&#x5DEE;&#x4E0D;&#x591A;&#x55B7;&#x4E86;&#x6709;1&#x7C73;&#x8FDC;&#xFF0C;&#x53F6;&#x65E5;&#x72D7;&#x5C45;&#x7136;&#x6DF1;&#x85CF;&#x4E0D;&#x9732;&#x8FD8;&#x7EC3;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x6B66;&#x529F;&#x3002;</p>
<p>&#x8BF4;&#x660E;&#xFF1A;&#x5728;&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x603B;&#x6709;&#x5201;&#x6C11;&#x60F3;&#x5BB3;&#x6715;&#xFF0C;&#x6211;&#x59D1;&#x4E14;&#x6709;&#x201D;&#x95F4;&#x6B47;&#x6027;&#x5931;&#x5FC6;&#x75C7;&#x201C;&#xFF0C;&#x7ADF;&#x7136;&#x628A;&#x5404;&#x5927;&#x65E5;&#x5929;&#x4EEC;&#x6392;&#x540D;&#x8BB0;&#x9519;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x79C1;&#x4E0B;&#x95EE;&#x53F6;&#x65E5;&#x72D7;&#xFF08;&#x6CE8;&#x610F;po&#x4E3B;&#x63AA;&#x8F9E;&#xFF09;&#xFF0C;&#x7ED3;&#x679C;&#x53F6;&#x65E5;&#x72D7;&#x65E0;&#x9650;&#x653E;&#x5927;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x671D;&#x4E00;&#x65E5;&#x6211;&#x6709;&#x7A7A;&#x7684;&#x8BDD;&#x771F;&#x60F3;&#x51FA;&#x4E00;&#x672C;&#x4E66;&#x300A;&#x4F60;&#x6240;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x53F6;&#x65E5;&#x72D7;&#x300B;&#x3002;</p>
<p>&#x519B;&#x8BAD;&#x5B8C;&#x540E;&#x5C31;&#x5F00;&#x8BFE;&#x4E86;&#xFF0C;&#x7D27;&#x63A5;&#x7740;&#x8F85;&#x5BFC;&#x5458;&#x9F99;&#x54E5;&#x4E0A;&#x573A;&#xFF0C;&#x8BB0;&#x5F97;&#x7B2C;&#x4E00;&#x5929;&#x9F99;&#x54E5;&#x5C31;&#x516C;&#x5E03;&#x4E86;&#x9662;&#x6821;&#x7684;&#x5404;&#x9879;&#x53D8;&#x6001;&#x6761;&#x6B3E;&#xFF0C;&#x603B;&#x4E4B;&#x751A;&#x662F;&#x65E0;&#x8DA3;&#xFF08;&#x8DDF;&#x8BFB;&#x5C01;&#x95ED;&#x9AD8;&#x4E2D;&#x4F3C;&#x7684;&#xFF09;&#xFF0C;&#x6211;&#x7B49;&#x201D;&#x597D;&#x201C;&#x5B66;&#x751F;&#x81EA;&#x7136;&#x4E25;&#x683C;&#x9075;&#x5B88;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x82E5;&#x4E0D;&#x9075;&#x5B88;&#x5B66;&#x6821;&#x6761;&#x6B3E;&#xFF0C;&#x90A3;&#x4E48;&#x6BCF;&#x5E74;&#x62E8;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x8D2B;&#x56F0;&#x751F;&#x52A9;&#x5B66;&#x91D1;&#x540D;&#x989D;&#x5C31;&#x6CA1;&#x620F;&#x4E86;&#xFF0C;&#x5F88;&#x660E;&#x663E;&#x8D2B;&#x56F0;&#x751F;&#x6211;&#x7B2C;&#x4E00;&#x5E74;&#x6CA1;&#x6709;&#x88AB;&#x9009;&#x4E2D;&#xFF0C;&#x5176;&#x539F;&#x56E0;po&#x4E3B;&#x5BF9;&#x7535;&#x5B50;&#x4EA7;&#x54C1;&#x5174;&#x8DA3;&#x6D53;&#x539A;&#xFF0C;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x8BFA;&#x57FA;&#x4E9A;&#xFF08;NOKIA&#xFF09;&#x8FD8;&#x6CA1;&#x6709;&#x5012;&#x95ED;&#xFF0C;&#x6211;&#x603B;&#x662F;&#x559C;&#x6B22;&#x67E5;&#x914D;&#x7F6E;&#x67E5;&#x53C2;&#x6570;&#x73A9;&#x624B;&#x673A;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x5F97;&#x4E0D;&#x63D0;&#x6211;&#x8001;&#x4E61;&#xFF08;&#x4EAC;&#x5C71;&#x7684;&#xFF09;&#x9065;&#x5B50;&#xFF08;&#x9065;&#x9065;&#xFF09;&#xFF0C;&#x4ED6;&#x9020;&#x8BE3;&#x9887;&#x6DF1;&#xFF0C;&#x57FA;&#x672C;&#x4E00;&#x4E2A;&#x6708;&#x4E00;&#x90E8;&#x624B;&#x673A;&#xFF0C;&#x5728;&#x5F53;&#x65F6;&#x8BF8;&#x5982;&#x4EE5;&#x4E0B;&#x673A;&#x578B;&#xFF1A;&#x7D22;&#x5C3C;&#x7231;&#x7ACB;&#x4FE1;x1&#x3001;&#x6469;&#x6258;&#x7F57;&#x62C9;Milestone&#xFF08;&#x7B2C;&#x4E00;&#x4EE3;&#x91CC;&#x7A0B;&#x7891;&#xFF09;&#x3001;&#x8BFA;&#x57FA;&#x4E9A;5800&#x548C;iPhone 3G&#xFF08;po&#x4E3B;&#x8FD9;&#x91CC;&#x4E3B;&#x8981;&#x5217;&#x4E3E;&#x4E86;&#x4E00;&#x4E9B;&#x4EE3;&#x8868;&#x673A;&#x578B;&#xFF1A;&#x6BD4;&#x5982;&#x8BF4;x1&#x662F;Windows Mobile&#x65D7;&#x8230;&#x3001;Milestone&#x662F;android&#x65D7;&#x8230;&#x3001;5800&#x662F;Symbian&#x65D7;&#x8230;&#x53CA;iOS&#x65D7;&#x8230; &#xFF09;&#xFF0C;&#x5176;&#x4ED6;&#x673A;&#x7687;&#x5728;&#x6B64;&#x5C31;&#x4E0D;&#x5217;&#x4E3E;&#x4E86;&#xFF08;&#x5176;&#x5B9E;&#x662F;po&#x4E3B;&#x4E3E;&#x4E0D;&#x51FA;&#x6817;&#x5B50;&#xFF09;&#xFF0C;&#x6211;&#x81EA;&#x7136;&#x4E5F;&#x8DDF;&#x7740;&#x6CBE;&#x6CBE;&#x5149;&#xFF08;&#x5728;&#x6B64;&#x58F0;&#x660E;po&#x4E3B;&#x4E0A;&#x5B66;&#x65F6;&#x77EE;&#x77EC;&#x7A77;&#xFF0C;&#x8FD8;&#x6709;&#x4E2A;&#x59B9;&#x5B50;&#xFF09;&#xFF0C;&#x5728;&#x5174;&#x8DA3;&#x7231;&#x597D;&#x4E0A;&#x4FE9;&#x4EBA;&#x7279;&#x522B;&#x6295;&#x673A;&#xFF0C;&#x5C31;&#x6BD4;&#x5982;&#x8BF4;&#x90A3;&#x53CC;&#x8010;&#x514B;&#x7A7A;&#x519B;&#x4E00;&#x53F7;&#xFF08;AF-1&#x5168;&#x767D;&#xFF09;&#x4EF7;&#x683C;&#x662F;799&#x8F6F;&#x59B9;&#x5E01;&#xFF0C;&#x5F88;&#x60F3;&#x62E5;&#x6709;&#x4E00;&#x53CC;&#xFF0C;&#x53EA;&#x5230;po&#x4E3B;&#x540E;&#x6765;&#x5DE5;&#x4F5C;&#x624D;&#x7B97;&#x6B63;&#x771F;&#x5165;&#x624B;&#xFF08;&#x8865;&#x5145;&#x4E0B;&#xFF1A;&#x9EC4;&#x65E5;&#x5929;&#x6709;&#x6B21;&#x8BF4;&#x60F3;&#x5165;&#x673A;&#x8BA9;&#x6211;&#x63A8;&#x8350;&#xFF0C;&#x5C31;&#x63A8;&#x8350;&#x4E86;NOKIA 6120C&#x8FD8;&#x6709;&#x660E;&#x955C;&#x7F8E;&#x7537;&#x5B50;&#x6211;&#x7ED9;&#x63A8;&#x8350;&#x4E86;NOKIA 5xxxx&#xFF0C;&#x535A;&#x542F;&#x738B;&#x4E5F;&#x5165;&#x4E86;&#x540C;&#x6B3E;&#xFF09;&#x3002;&#x626F;&#x5F97;&#x6709;&#x70B9;&#x513F;&#x591A;&#xFF0C;&#x5F53;&#x7136;&#x6CA1;&#x6709;&#x88AB;&#x8BC4;&#x4E0A;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x539F;&#x56E0;&#xFF0C;&#x6BD4;&#x5982;&#x4E0D;&#x80FD;&#x6709;&#x59B9;&#x5B50;&#xFF0C;&#x90A3;&#x9F99;&#x54E5;&#x662F;&#x600E;&#x4E48;&#x77E5;&#x9053;po&#x4E3B;&#x6709;&#x59B9;&#x5B50;&#x7684;&#x5462;&#xFF1F;&#x5F53;&#x521D;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x54EA;&#x91CC;&#x6765;&#x7684;&#x89C4;&#x77E9;&#x8BF4;&#xFF1A;&#x6709;&#x59B9;&#x5B50;&#x5FC5;&#x987B;&#x8981;&#x53D1;&#x7CD6;&#xFF0C;&#x6211;&#x4E5F;&#x7B97;&#x662F;&#x968F;&#x6CE2;&#x9010;&#x6D41;&#x4E86;&#x4E00;&#x628A;&#x8DDF;&#x4E86;&#x98CE;&#xFF0C;&#x7ADF;&#x7136;&#x628A;&#x7CD6;&#x53D1;&#x5230;&#x9F99;&#x54E5;&#x624B;&#x91CC;&#x4E86;&#xFF0C;&#x6DF1;&#x6DF1;&#x8BB0;&#x5F97;&#x90A3;&#x5929;&#x662F;2008&#x5E74;&#x73ED;&#x7EA7;&#x5143;&#x65E6;&#x665A;&#x4F1A;&#xFF0C;&#x6211;&#x5531;&#x4E86;&#x90A3;&#x9996;&#x4E94;&#x6708;&#x5929;&#x7684;&#x300A;&#x77E5;&#x8DB3;&#x300B;&#xFF08;&#x5176;&#x5B9E;po&#x4E3B;&#x81EA;&#x8BA4;&#x4E3A;&#x4E0D;&#x7B97;&#x662F;&#x4E94;&#x97F3;&#x4E0D;&#x5168;&#x7684;&#x90A3;&#x4E00;&#x7C7B;&#xFF0C;&#x4E0A;&#x9AD8;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5BF9;&#x5531;&#x6B4C;&#x9020;&#x8BE3;&#x751A;&#x9AD8;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x5BA3;&#x5E03;&#x53D1;&#x7CD6;&#x4E86;&#xFF01;&#x591A;&#x5E74;&#x6BD5;&#x4E1A;&#x540E;&#x9F99;&#x54E5;&#x8FD8;&#x63D0;&#x8D77;&#x4E86;&#x8FD9;&#x6863;&#x5B50;&#x4E8B;&#x513F;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x5E74;&#x5BBF;&#x820D;&#x65E5;&#x5929;&#x4EEC;&#x51E0;&#x4E4E;&#x90FD;&#x83B7;&#x5F97;&#x4E86;&#x52A9;&#x5B66;&#x91D1;&#xFF0C;&#x4E5F;&#x5C31;&#x90FD;&#x6512;&#x4E86;&#x673A;&#xFF0C;po&#x4E3B;&#x5F53;&#x65F6;&#x6CA1;&#x6709;&#x6512;&#x673A;&#xFF0C;&#x8DDF;&#x5BB6;&#x91CC;&#x5546;&#x91CF;&#x4E0B;&#x51B3;&#x5B9A;&#x5165;&#x624B;&#x7B14;&#x8BB0;&#x672C;&#xFF0C;&#x7136;&#x540E;&#x6000;&#x63E3;&#x7740;&#x7236;&#x6BCD;&#x8F9B;&#x8F9B;&#x82E6;&#x82E6;&#x7ED9;&#x6211;&#x7684;5000&#x4EBA;&#x540D;&#x5E01;&#x4ECE;&#x5B5D;&#x611F;&#x8DD1;&#x5230;&#x6B66;&#x6C49;&#x5E7F;&#x57E0;&#x5C6F;&#x5165;&#x624B;&#x4EBA;&#x751F;&#x7684;&#x7B2C;&#x4E00;&#x90E8;&#x7535;&#x8111;ThinkPad SL400&#x7CFB;&#x5217;&#xFF08;&#x8FD9;&#x53F0;&#x7535;&#x8111;&#x7EC8;&#x7A76;&#x6CA1;&#x6709;&#x8BA9;&#x6211;&#x5931;&#x671B; &#xFF0C;&#x670D;&#x5F79;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x671F;&#x95F4;&#x53EA;&#x662F;&#x5728;&#x5317;&#x4EAC;&#x65AD;&#x8FC7;&#x4E00;&#x6B21;&#x8F74;&#xFF0C;&#x4E0D;&#x8FC7;&#x73B0;&#x5728;po&#x4E3B;&#x56E0;&#x4E3A;&#x5DE5;&#x4F5C;&#x6240;&#x9700;12&#x5E74;&#x4E5F;&#x518D;&#x6B21;&#x5165;&#x624B;Win&#x7CFB;Lenovo&#xFF0C;&#x518D;&#x5230;&#x73B0;&#x5728;&#x7684;Mac OS X&#x7CFB;Pro&#xFF09;&#x3002;&#x8BB0;&#x5F97;09&#x5E74;&#x5E2E;&#x9EC4;&#x65E5;&#x5929;&#x4E5F;&#x5728;&#x5E7F;&#x57E0;&#x5C6F;&#x5165;&#x624B;&#x4E86;&#x534E;&#x7855;N80&#x6E38;&#x620F;&#x672C;&#xFF0C;&#x90A3;&#x53F0;&#x672C;&#x5B50;&#x663E;&#x5361;&#x6027;&#x80FD;&#x5353;&#x8D8A;&#xFF0C;&#x56E0;&#x4E3A;&#x9EC4;&#x961F;&#x662F;&#x6E38;&#x620F;&#x53D1;&#x70E7;&#x53CB;&#xFF0C;&#x8BB0;&#x5F97;&#x4ED6;&#x8DDF;LD&#x8BF4;&#x4E70;&#x672C;&#x5B50;&#x65F6;&#xFF0C;&#x4ED6;LD&#x76F4;&#x63A5;&#x7ED9;&#x4ED6;&#x6253;&#x4E86;12000&#xFF0C;&#x5B9A;&#x90A3;&#x53F0;&#x673A;&#x5668;&#x7684;&#x65F6;&#x5019;&#x662F;&#x5728;ATM&#x63D0;&#x4E86;9000&#x7684;&#x73B0;&#x91D1;&#xFF0C;&#x5728;&#x5F53;&#x65F6;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x6000;&#x63E3;&#x8FC7;&#x8FD9;&#x4E48;&#x591A;&#x73B0;&#x91D1;&#xFF0C;&#x5F53;&#x65F6;&#x771F;&#x60F3;&#x9ED1;&#x4ED6;&#x4E00;&#x628A;&#x3002;</p>
<p>&#x8BF4;&#x660E;&#xFF1A;po&#x4E3B;&#x6BD5;&#x4E1A;&#x540E;&#x4ECE;&#x4E8B;&#x4E86;&#x8BA1;&#x7B97;&#x673A;IT&#x8F6F;&#x4EF6;&#xFF0C;&#x4E5F;&#x662F;&#x53D7;&#x5230;&#x5927;&#x5B66;&#x65F6;&#x6700;&#x5C0A;&#x656C;&#x7684;&#x300A;C&#x8BED;&#x8A00;&#x57FA;&#x7840;&#x300B;&#x674E;&#x5C9A;&#x8001;&#x5E08;&#x6307;&#x5BFC;&#xFF0C;po&#x4E3B;&#x5C5E;&#x4E8E;&#x504F;&#x79D1;&#x7279;&#x4E25;&#x91CD;&#x7684;&#x4E00;&#x7C7B;&#xFF0C;&#x9AD8;&#x8003;&#x82F1;&#x8BED;&#x53EA;&#x8003;&#x4E86;36&#x5206;&#xFF0C;&#x6570;&#x5B66;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x7B2C;&#x4E00;&#x6B21;&#x542C;&#x8FD9;&#x95E8;&#x8BFE;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5174;&#x8DA3;&#x6D53;&#x539A;&#xFF0C;&#x800C;&#x4E14;&#x674E;&#x8001;&#x5E08;&#x8BB2;&#x5F97;&#x901A;&#x4FD7;&#x6613;&#x61C2;&#xFF0C;&#x7B97;&#x662F;&#x5165;&#x4E86;&#x95E8;&#x5427;&#xFF01;&#x518D;&#x5230;&#x540E;&#x6765;&#x8BFE;&#x540E;&#x7ECF;&#x5E38;&#x770B;&#x89C6;&#x9891;&#x6559;&#x7A0B;&#xFF0C;&#x603B;&#x4E4B;&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#x8FD9;&#x7C7B;&#x4E1C;&#x897F;&#xFF0C;&#x5F53;&#x521D;&#x559C;&#x6B22;&#x7684;&#x539F;&#x56E0;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x89C9;&#x5F97;&#x5B83;&#x6BD4;&#x8F83;&#x9AD8;&#x7EA7;&#x3002;</p>
<p>&#x67D0;&#x5929;&#x5BBF;&#x820D;&#x5F20;&#x65E5;&#x5929;&#x63A8;&#x8350;&#x4E86;&#x4E00;&#x90E8;&#x5E7F;&#x64AD;&#x5267;&#x2013;&#x300A;&#x8BA9;&#x9752;&#x6625;&#x7EE7;&#x7EED;&#x300B;&#xFF0C;po&#x4E3B;&#x53D7;&#x5230;&#x8FD9;&#x90E8;&#x5E7F;&#x64AD;&#x5267;&#x7684;&#x5F71;&#x54CD;&#x5F88;&#x5927;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x5E7B;&#x60F3;&#x7740;&#x81EA;&#x5DF1;&#x5C31;&#x8DDF;&#x5267;&#x4E2D;&#x7684;buynow&#x4E00;&#x6837;&#xFF0C;&#x4E5F;&#x6709;&#x7740;&#x90A3;&#x9897;&#x6C38;&#x8FDC;&#x6700;&#x5E74;&#x8F7B;&#x6700;&#x73CD;&#x8D35;&#x7684;&#x5FC3;&#xFF0C;&#x6211;&#x662F;&#x4E0D;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;po&#x4E3B;&#x628A;&#x59B9;&#x4E5F;&#x662F;&#x501F;&#x9274;&#x4E86;&#x91CC;&#x9762;&#x7684;&#x62DB;&#x6570;&#xFF0C;&#x8FD9;&#x90E8;&#x5E7F;&#x64AD;&#x5267;&#x6211;&#x524D;&#x524D;&#x540E;&#x540E;&#x542C;&#x4E86;3-5&#x904D;&#xFF0C;&#x7B2C;&#x4E00;&#x904D;&#x5B8C;&#x6574;&#x542C;&#x5B8C;&#x662F;&#x548C;&#x65E5;&#x5929;&#x4EEC;&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x5F20;&#x65E5;&#x5929;&#x3001;&#x674E;&#x65E5;&#x5929;&#xFF08;&#x88AB;&#x7ED1;&#x51B0;&#xFF09;&#x3001;&#x5F90;&#x65E5;&#x5929;&#xFF08;&#x7ECF;&#x5546;&#x5F90;&#xFF09;&#x8BF4;&#x662F;&#x51C6;&#x5907;&#x5728;&#x5BBF;&#x820D;&#x5F00;&#x4E2A;&#x5C0F;&#x5356;&#x90E8;&#xFF0C;&#x5F53;&#x65F6;&#x5BBF;&#x820D;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x5165;&#x80A1;&#x4E86;&#xFF0C;&#x8FA3;&#x6761;&#x6709;0.15RMB&#x5229;&#x6DA6;&#x3001;&#x5317;&#x4EAC;&#x65B9;&#x4FBF;&#x9762;&#x4E00;&#x7BB1;&#x53EA;&#x6709;1RMB&#x5229;&#x6DA6;&#x3001;&#x77FF;&#x6CC9;&#x6C34;&#x5229;&#x6DA6;&#x6BD4;&#x8F83;&#x53EF;&#x89C2;&#x80FD;&#x6709;0.6RMB&#x518D;&#x5C31;&#x662F;&#x6876;&#x9762;0.8RMB&#x5229;&#x6DA6;&#xFF0C;&#x5F53;&#x7136;&#x8FD8;&#x7ECF;&#x8425;&#x5176;&#x4ED6;&#x996E;&#x6599;&#x2026;&#x6211;&#x4EEC;&#x5F00;&#x4E1A;&#x5C31;&#x76C8;&#x5229;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x5B66;&#x6821;&#x540E;&#x7684;&#x9910;&#x9986;&#x6413;&#x4E86;&#x4E00;&#x987F;&#xFF08;&#x90A3;&#x5BB6;&#x9910;&#x9986;&#x7684;&#x70E7;&#x83DC;&#x6280;&#x827A;&#x5F88;&#x9AD8;&#xFF0C;&#x8611;&#x83C7;&#x7092;&#x86CB;&#x3001;&#x8150;&#x7AF9;&#x7092;&#x8089;&#x548C;&#x6CB9;&#x6DCB;&#x571F;&#x8C46;&#x7247;&#xFF0C;&#x767D;&#x9152;&#x662F;&#x679D;&#x6C5F;&#x5927;&#x66F2;&#xFF0C;&#x5564;&#x9152;&#x662F;&#x96EA;&#x82B1;&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x60C5;&#x8282;&#x8DDF;&#x8FD9;&#x5267;&#x60C5;&#x7C7B;&#x4F3C;&#xFF0C;&#x5403;&#x996D;+&#x559D;&#x9152;+&#x628A;&#x59B9;&#xFF0C;po&#x4E3B;&#x6CA1;&#x6709;&#x7CBE;&#x786E;&#x7EDF;&#x8BA1;&#x9189;&#x9152;&#x6B21;&#x6570;&#xFF0C;&#x53E6;&#x5916;&#x63D2;&#x53E5;&#xFF1A;&#x5927;&#x5B66;&#x7B2C;&#x4E00;&#x6B21;&#x559D;&#x9152;&#x8FD8;&#x662F;&#x9EC4;&#x65E5;&#x5929;&#x8FC7;&#x751F;&#x65E5;&#x8BF7;&#x6211;&#x4EEC;&#x5728;&#x864E;&#x8D32;&#x9910;&#x9986;&#xFF0C;&#x53C2;&#x4F1A;&#x7684;&#x6709;&#x5F20;&#x65E5;&#x5929;&#x3001;&#x53F6;&#x65E5;&#x5929;&#x3001;&#x59DA;&#x65E5;&#x5929;&#xFF08;&#x5199;&#x5F97;&#x4E00;&#x624B;&#x597D;&#x5B57;&#xFF09;&#x3001;&#x5C0F;&#x4E50;&#x5B50;&#xFF08;&#x5F20;&#x4E50;&#xFF09;&#xFF0C;&#x6BD4;&#x8F83;&#x9A84;&#x50B2;&#x7684;&#x662F;&#x6211;&#x628A;&#x4ED6;&#x4EEC;&#x51E0;&#x4E4E;&#x5168;&#x559D;&#x8DB4;&#x4E0B;&#x4E86;&#xFF0C;po&#x4E3B;&#x4E0A;&#x9AD8;&#x4E2D;&#x9152;&#x91CF;&#x5C31;&#x8D77;&#x6765;&#x4E86;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x53C2;&#x9605;&#x6211;&#x53E6;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x300A;&#x9AD8;&#x4E2D;&#x6211;&#x4EEC;&#x805A;&#x805A;&#x300B;&#xFF0C;&#x8FD9;&#x6BB5;&#x5386;&#x53F2;&#x5230;&#x5927;&#x5B66;&#x6BD5;&#x4E1A;&#x65F6;&#x88AB;&#x6539;&#x5199;&#xFF0C;&#x8FD9;&#x91CC;&#x64C5;&#x957F;&#x767D;&#x9152;&#xFF1A;&#x674E;&#x65E5;&#x5929;&#x3001;&#x5218;&#x65E5;&#x5929;&#x3001;&#x53F6;&#x65E5;&#x5929;&#x3001;&#x559D;&#x4E0D;&#x5012;&#x7684;&#x8001;&#x4E09;&#xFF08;&#x767D;&#x9152;&#x4E0D;&#x591A;&#x4E0D;&#x591A;1&#x65A4;&#x534A;&#xFF0C;&#x5564;&#x9152;&#x6709;&#x591A;&#x5C11;&#x559D;&#x591A;&#x5C11;&#xFF09;&#xFF1B;&#x8FD9;&#x91CC;&#x9762;&#x6700;&#x4E0D;&#x80FD;&#x559D;&#x7684;&#x5C31;&#x662F;&#xFF1A;&#x5EB7;&#x603B;&#xFF1B;&#x80FD;&#x559D;&#x5374;&#x4E0D;&#x559D;&#x7684;&#x662F;&#xFF1A;&#x6731;&#x65E5;&#x5929;&#x3001;&#x5F90;&#x65E5;&#x72D7;&#x3001;&#x5F6D;&#x65E5;&#x5929; &#xFF08;&#x58A9;&#x58A9;&#xFF09;&#xFF1B;&#x9152;&#x91CF;&#x53D8;&#x5316;&#x5927;&#x7684;&#x662F;&#xFF1A;&#x5F20;&#x65E5;&#x5929;&#xFF1B;&#x9152;&#x54C1;&#x6700;&#x5DEE;&#x7684;&#x662F;po&#x4E3B;&#xFF08;&#x518D;&#x6B21;&#x58F0;&#x660E;&#xFF1A;po&#x4E3B;&#x5DE5;&#x4F5C;&#x4EE5;&#x6765;&#x966A;&#x9886;&#x5BFC;&#x5BA2;&#x6237;&#x559D;&#x9152;&#x9152;&#x54C1;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x53EF;&#x80FD;&#x8DDF;&#x4F60;&#x4EEC;&#x592A;&#x719F;&#x4E86;&#x4EE5;&#x81F3;&#x4E8E;&#x843D;&#x4E0B;&#x8FD9;&#x4E2A;&#x540D;&#x58F0;&#xFF0C;&#x603B;&#x6709;&#x5201;&#x6C11;&#x60F3;&#x5BB3;&#x6715;&#xFF09;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x7B97;&#x662F;&#x5927;&#x5B66;&#x671F;&#x95F4;&#x6700;&#x57FA;&#x7840;&#x7684;&#x5A31;&#x4E50;&#xFF0C;&#x4EBA;&#x7269;&#x4E0D;&#x5206;&#x5148;&#x540E;&#xFF0C;&#x53EF;&#x80FD;&#x7C97;&#x5FC3;&#x7684;po&#x4E3B;&#x4F1A;&#x9057;&#x6F0F;&#x6389;&#x5F88;&#x591A;&#x7EC6;&#x8282;&#xFF0C;&#x4E5F;&#x671B;&#x8C05;&#x89E3;&#xFF01;&#x5927;&#x5BB6;&#x89C9;&#x5F97;&#x7CBE;&#x5F69;&#x7684;&#x4E5F;&#x656C;&#x8BF7;&#x8865;&#x5145;&#xFF01;</p>
<p>&#x5218;&#x65E5;&#x5929;&#x603B;&#x662F;&#x5728;&#x5BBF;&#x820D;&#x8BF4;&#xFF1A;&#x4F60;&#x4EEC;&#x53EF;&#x4EE5;&#x5411;&#x73ED;&#x91CC;&#x8FD9;&#x4F4D;&#x540C;&#x5B66;&#x5B66;&#x4E60;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;&#x7136;&#x540E;&#x5979;&#x5C31;&#x53EB;&#x4E86;&#x6211;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7B2C;&#x4E00;&#x671F;&#x4EFB;&#x804C;&#x7684;&#x5B66;&#x4E60;&#x59D4;&#x5458;xx&#x5E73;&#xFF0C;&#x6BCF;&#x6B21;&#x56DE;&#x53BB;&#x5BBF;&#x820D;&#x90FD;&#x4F1A;&#x88AB;&#x5218;&#x65E5;&#x5929;&#x4E00;&#x518D;&#x91CD;&#x590D;&#x3002;&#x6709;&#x6B21;&#x5728;&#x5DF4;&#x897F;&#x70E4;&#x8089;&#x6211;&#x8FD8;&#x5E2E;&#x5979;&#x89E3;&#x4E86;&#x56F4;&#xFF0C;&#x5979;&#x8BF4;&#x8BF7;&#x6211;&#x5403;&#x665A;&#x996D;&#xFF0C;&#x6211;&#x8BB0;&#x5F97;&#x662F;&#x4E00;&#x4EFD;&#x9E21;&#x86CB;&#x7092;&#x7C89;&#xFF0C;&#x5979;&#x8FD8;&#x50BB;&#x4E0D;&#x62C9;&#x51E0;&#x7684;&#x95EE;&#x6211;&#x559D;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x8BF4;&#x559D;&#x5564;&#x9152;&#xFF08;&#x53EA;&#x662F;&#x5FFD;&#x60A0;&#x5979;&#xFF09;&#xFF0C;&#x5979;&#x8FD8;&#x771F;&#x53BB;&#x62FF;&#x4E86;&#x4E00;&#x542C;&#x5564;&#x9152;&#xFF0C;&#x6700;&#x540E;&#x6211;&#x8BF4;&#x7ED9;&#x4F60;&#x5F00;&#x73A9;&#x7B11;&#x7684;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x6697;&#x793A;&#x7740;&#x6211;&#x673A;&#x4F1A;&#x6765;&#x4E86;&#xFF0C;&#x601D;&#x7D22;&#x826F;&#x4E45;&#x56E0;&#x4E3A;&#x5F53;&#x521D;&#x8FD8;&#x5BF9;&#x9AD8;&#x4E2D;&#x7684;&#x90A3;&#x4F4D;&#x5176;&#x5B9E;&#x4E5F;&#x8BF4;&#x4E0D;&#x6E05;&#x695A;&#x662F;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#xFF0C;&#x53EA;&#x77E5;&#x9053;08&#x5E74;&#x5149;&#x68CD;&#x8282;&#x6211;&#x4EEC;&#x8FD8;&#x901A;&#x8FC7;&#x7535;&#x8BDD;&#xFF0C;&#x773C;&#x524D;&#x7684;&#x5979;&#x4F60;&#x662F;&#x5426;&#x8981;&#x8F9C;&#x8D1F;&#x2026;&#x67D0;&#x65E5;&#xFF08;&#x662F;2008&#x5E74;11&#x6708;20&#x65E5;&#xFF09;&#x6211;&#x5728;&#x4E00;&#x4E2A;&#x6708;&#x9ED1;&#x98CE;&#x9AD8;&#x591C;&#x7684;&#x665A;&#x4E0A;&#xFF0C;&#x90A3;&#x5929;&#x7279;&#x522B;&#x51B7;&#x8FD8;&#x522E;&#x4E86;&#x5927;&#x98CE;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x505C;&#x7535;&#x4E86;&#xFF0C;&#x6211;&#x51B3;&#x5B9A;&#x53BB;&#x505A;&#x4E00;&#x4EF6;&#x4F1F;&#x5927;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E0D;&#x52A0;&#x601D;&#x7D22;&#x7684;&#x5C31;&#x7EA6;&#x5728;&#x4E86;&#x6821;&#x56ED;&#x6FA1;&#x5802;&#x95E8;&#x53E3;&#xFF08;&#x5176;&#x5B9E;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4F55;&#x7EA6;&#x5728;&#x90A3;&#x513F;&#xFF0C;&#x8BF7;&#x4E0D;&#x8981;&#x60F3;&#x6B6A;&#xFF09;&#xFF0C;&#x60C5;&#x8282;&#x5C31;&#x662F;&#xFF1A;&#x4E09;&#x3001;&#x4E8C;&#x3001;&#x4E00;&#x2026;&#x6211;&#x9ED8;&#x6570;&#x5012;&#x8BA1;&#x65F6;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x63E1;&#x4F4F;&#x5979;&#x7684;&#x624B;&#xFF0C;&#x5979;&#x7684;&#x624B;&#x7279;&#x522B;&#x5A07;&#x5AE9;&#xFF08;&#x5979;&#x8BF4;&#x5979;&#x6700;&#x559C;&#x6B22;&#x5979;&#x7684;&#x624B;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x2026;&#x6700;&#x540E;&#x2026;&#x4E5F;&#x5C31;&#x987A;&#x7406;&#x6210;&#x7AE0;&#x7684;&#x628A;&#x5230;&#x59B9;&#x4E86;&#x3002;&#x5728;&#x90A3;&#x4E2A;&#x61F5;&#x61C2;&#x7684;&#x65F6;&#x671F;&#xFF0C;&#x6211;&#x8DDF;&#x5979;&#x8D70;&#x5F97;&#x6BD4;&#x8F83;&#x8FD1;&#xFF0C;&#x4E0A;&#x673A;&#x7684;&#x8BFE;&#x5979;&#x5FC5;&#x987B;&#x8981;&#x6328;&#x7740;&#x6211;&#x5750;&#x624D;&#x80FD;&#x591F;&#x641E;&#x61C2;&#x8001;&#x5E08;&#x7684;&#x8BFE;&#xFF0C;&#x7537;&#x751F;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x52A8;&#x624B;&#x80FD;&#x529B;&#x5F3A;&#xFF08;&#x5176;&#x5B9E;po&#x4E3B;&#x4ECE;&#x5C0F;&#x5C31;&#x559C;&#x6B22;&#x778E;&#x903C;&#x62C6;&#x4E1C;&#x897F;&#xFF0C;&#x5355;&#x653E;&#x673A;&#x3001;&#x6536;&#x97F3;&#x673A;&#x548C;&#x7535;&#x89C6;&#x673A;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x611F;&#x89C9;&#x6BD4;&#x8F83;&#x9AD8;&#x7EA7;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x4F1A;&#x60F3;&#x529E;&#x6CD5;&#x62C6;&#x5F00;&#xFF09;&#xFF0C;&#x800C;&#x5979;&#x53C8;&#x662F;&#x7B2C;&#x4E00;&#x671F;&#x7684;&#x5B66;&#x4E60;&#x59D4;&#x5458;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x6293;&#x597D;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x4E5F;&#x5C31;&#x987A;&#x5229;&#x5F97;&#x901E;&#x4E86;&#x3002;&#x6709;&#x51E0;&#x6B21;&#x5979;&#x7ADF;&#x7136;&#x4E0D;&#x548C;po&#x4E3B;&#x4E00;&#x8D77;&#x5750;&#xFF0C;&#x7136;&#x540E;&#x8001;&#x5E08;&#x8BB2;&#x7684;&#x8BFE;&#x5979;&#x6CA1;&#x6709;&#x542C;&#x61C2;&#xFF0C;&#x5728;&#x6211;&#x8BB0;&#x5FC6;&#x4E2D;&#x6709;&#x51E0;&#x6B21;&#x542C;&#x5230;&#x673A;&#x623F;&#x540E;&#x4F20;&#x6765;&#x549A;&#x7684;&#x4E00;&#x751F;&#xFF0C;&#x540C;&#x5B66;&#x4EEC;&#x90FD;&#x56DE;&#x5934;&#x6CE8;&#x89C6;&#x7740;&#x540E;&#x9762;&#xFF0C;&#x5979;&#x4ECE;&#x677F;&#x51F3;&#x4E0A;&#x722C;&#x4E86;&#x8D77;&#x6765;&#x3002;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x4E0D;&#x5F97;&#x4E0D;&#x670D;&#xFF0C;po&#x4E3B;&#x5269;&#x4E0B;&#x7684;&#x53EA;&#x6709;&#x624D;&#x534E;&#x3002;</p>
<p>2010&#x5E74;6&#x6708;&#x4EFD;&#x5B9E;&#x4E60;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x7EC8;&#x5C06;&#x5206;&#x522B;&#x4E86;&#xFF0C;&#x5979;&#x53BB;&#x4E86;&#x6C5F;&#x82CF;&#x6606;&#x5C71;&#x5723;&#x7F8E;&#x7CBE;&#x5BC6;&#xFF0C;&#x6709;&#x8FC7;&#x51E0;&#x6B21;&#x6D41;&#x6C34;&#x7EBF;&#x7ECF;&#x5386;&#x7684;&#x6211;&#x3001;&#x5EB7;&#x65E5;&#x5929;&#x548C;&#x5F20;&#x65E5;&#x5929;&#x4E00;&#x8D77;&#x7559;&#x5728;&#x5B66;&#x6821;&#x5B66;&#x4E60;CCNA&#x7CFB;&#x5217;&#x8BFE;&#x7A0B;&#xFF0C;&#x6253;&#x7B97;&#x4EE5;&#x540E;&#x4ECE;&#x4E8B;&#x7F51;&#x7EDC;&#x5DE5;&#x7A0B;&#x5E08;&#x804C;&#x4E1A;&#xFF0C;&#x5B66;&#x5B8C;&#x540E;&#x6211;&#x4EEC;&#x4E5F;&#x5148;&#x540E;&#x53BB;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x57CE;&#x5E02;&#xFF0C;&#x5F20;&#x65E5;&#x5929;&#x53BB;&#x4E86;&#x5E7F;&#x5DDE;&#x4ECE;&#x4E8B;&#x9500;&#x552E;&#xFF0C;&#x5EB7;&#x65E5;&#x5929;&#x53BB;&#x4E86;&#x6DF1;&#x5733;&#x4ECE;&#x4E8B;LED&#x7535;&#x5B50;&#x884C;&#x4E1A;&#xFF0C;&#x6211;&#x53BB;&#x4E86;&#x4E1C;&#x839E;&#x957F;&#x5B89;&#x4ECE;&#x4E8B;Web&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#xFF08;ASP.NET&#xFF09;&#xFF0C;&#x4E5F;&#x7B97;&#x662F;&#x51FA;&#x95E8;&#x9047;&#x8D35;&#x4EBA;&#xFF0C;&#x6211;&#x9047;&#x5230;&#x4EBA;&#x751F;&#x4E2D;&#x6700;&#x597D;&#x7684;&#x8001;&#x5E08;&#x9EC4;&#x9AD8;&#x8FDC;&#xFF0C;&#x8D1F;&#x8D23;&#x505A;&#x4F01;&#x4E1A;&#x7F51;&#x7AD9;&#xFF0C;&#x6211;&#x548C;&#x5979;&#x4E2D;&#x9014;&#x51FA;&#x8FC7;&#x610F;&#x5916;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x60F3;&#x505A;&#x8FC7;&#x591A;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x6211;&#x53EA;&#x60F3;&#x8BF4;&#x90A3;&#x4E9B;&#x56E0;&#x4E3A;&#x5E74;&#x8F7B;&#x72AF;&#x4E0B;&#x7684;&#x9519;&#xFF0C;&#x5C31;&#x50CF;&#x79CB;&#x5929;&#x7684;&#x843D;&#x53F6;&#x65E9;&#x5DF2;&#x968F;&#x98CE;&#x800C;&#x8FC7;&#xFF0C;&#x5979;&#x4E5F;&#x7EC8;&#x7A76;&#x5728;2010&#x5E74;&#x4E2D;&#x79CB;&#x8282;&#x4ECE;&#x4E0A;&#x6D77;&#x62B5;&#x8FBE;&#x5230;&#x5E7F;&#x5DDE;&#xFF0C;&#x6211;&#x53BB;&#x5E7F;&#x5DDE;&#x7AD9;&#x63A5;&#x7684;&#x5979;&#xFF0C;&#x8BB0;&#x5F97;&#x5F53;&#x521D;&#x5750;&#x7684;&#x4E1C;&#x839E;&#x957F;&#x5B89;&#x7684;&#x5927;&#x5DF4;&#x5230;&#x5E7F;&#x5DDE;&#x7AD9;&#xFF0C;&#x542C;&#x5927;&#x5DF4;&#x5E08;&#x5085;&#x8BF4;&#x4F60;&#x8FD0;&#x6C14;&#x597D;&#xFF0C;&#x8FD9;&#x662F;&#x5230;&#x5E7F;&#x5DDE;&#x7AD9;&#x7684;&#x6700;&#x540E;&#x4E00;&#x73ED;&#x5DF4;&#x58EB;&#xFF0C;&#x5176;&#x5B9E;&#x5E7F;&#x4E1C;&#x7ED9;&#x6211;&#x7684;&#x611F;&#x89C9;&#x8FD8;&#x662F;&#x633A;&#x4E71;&#x7684;&#xFF0C;&#x90A3;&#x8FB9;&#x7684;&#x5927;&#x5DF4;&#x8F66;&#x6709;&#x4E00;&#x534A;&#x90FD;&#x662F;&#x9ED1;&#x8F66;&#xFF0C;&#x800C;&#x4E14;&#x8F66;&#x4E0A;&#x5C0F;&#x5077;&#x7279;&#x522B;&#x591A;&#xFF0C;&#x5927;&#x8857;&#x4E0A;&#x62A2;&#x52AB;&#x90FD;&#x662F;&#x6B63;&#x5E38;&#x7684;&#x5F88;&#xFF0C;&#x6211;&#x8DDF;&#x5979;&#x4E5F;&#x7B97;&#x518D;&#x6B21;&#x76F8;&#x9022;&#x3002;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x6839;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x4E24;&#x4E2A;&#x4EBA;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x76F8;&#x5904;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x4E3A;&#x4E00;&#x987F;&#x996D;&#x5435;&#x67B6;&#xFF0C;&#x6D17;&#x4E00;&#x6B21;&#x8863;&#x670D;&#x5435;&#x67B6;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8FD9;&#x6837;&#x6162;&#x6162;&#x5730;&#x78E8;&#x5408;&#x7740;&#xFF0C;&#x5C11;&#x5E74;&#x65F6;&#x68F1;&#x89D2;&#x5206;&#x660E;&#xFF0C;&#x65F6;&#x95F4;&#x6162;&#x6162;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x4E5F;&#x6E10;&#x6E10;&#x4E92;&#x76F8;&#x4E60;&#x60EF;&#x4E86;&#x3002;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x6BCF;&#x6708;&#x9886;&#x7740;1000&#x5DE6;&#x53F3;&#x7684;&#x85AA;&#x8D44;&#xFF0C;&#x4FE9;&#x4EBA;&#x4E0B;&#x73ED;&#x540E;&#x5C31;&#x53BB;&#x9644;&#x8FD1;&#x7684;&#x8D85;&#x5E02;&#x4E70;&#x5404;&#x79CD;&#x96F6;&#x98DF;&#xFF0C;&#x5F90;&#x798F;&#x8BB0;&#x5E7F;&#x4E1C;&#x9A70;&#x540D;&#x54C1;&#x724C;&#xFF0C;&#x4EF7;&#x683C;&#x8FD8;&#x7B97;&#x539A;&#x9053;&#xFF0C;&#x518D;&#x5C31;&#x662F;&#x53BB;&#x957F;&#x5B89;&#x7684;&#x6C83;&#x5C14;&#x739B;&#x4E70;&#x6930;&#x9999;&#x70E4;&#x9E21;&#x548C;&#x5373;&#x5C06;&#x6253;&#x70CA;&#x7684;&#x7092;&#x7C89;&#xFF0C;&#x90A3;&#x5473;&#x9053;&#x771F;&#x5FC3;&#x4E0D;&#x9519;&#xFF0C;&#x8BB0;&#x5F97;&#x6709;&#x6B21;&#x5979;&#x4E00;&#x4E2A;&#x4EBA;&#x786C;&#x628A;&#x4E00;&#x6574;&#x53EA;&#x70E4;&#x9E21;&#x89E3;&#x51B3;&#x6389;&#x4E86;&#x3002;&#x65F6;&#x95F4;&#x5C31;&#x8FD9;&#x6837;&#x5306;&#x5306;&#x6D41;&#x53BB;&#xFF0C;&#x5FEB;&#x5E74;&#x5E95;&#x6625;&#x8282;&#x8981;&#x56DE;&#x5BB6;&#xFF0C;2010&#x5E74;&#x4E5F;&#x662F;&#x4EBA;&#x751F;&#x7B2C;&#x4E00;&#x6B21;&#x5728;&#x5F02;&#x5730;&#x4F53;&#x9A8C;&#x5230;&#x6625;&#x8FD0;&#xFF0C;&#x5176;&#x5B9E;&#x5728;&#x6625;&#x8FD0;&#x6CA1;&#x6765;&#x524D;&#x6211;&#x5BF9;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x8111;&#x888B;&#x662F;&#x7A7A;&#x7684;&#xFF0C;&#x8FD8;&#x662F;&#x89C9;&#x5F97;&#x6625;&#x8FD0;&#x8DDF;&#x5E73;&#x65F6;&#x6709;&#x5565;&#x533A;&#x522B;&#xFF0C;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x4ECE;&#x7968;&#x8D29;&#x5B50;&#x624B;&#x91CC;&#x4E70;&#x5230;&#x4E24;&#x5F20;&#x4E34;&#x5BA2;&#xFF08;L&#x5F00;&#x5934;&#x7684;&#x8F66;&#x6B21;&#xFF09;&#xFF0C;&#x6211;&#x8BB0;&#x5F97;&#x662F;76RMB/&#x5F20;&#xFF0C;&#x4F46;&#x662F;&#x6BCF;&#x5F20;&#x9700;&#x8981;50RMB&#x624B;&#x7EED;&#x8D39;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x5750;&#x8FC7;&#x6700;&#x4FBF;&#x5B9C;&#x7684;&#x8F66;&#xFF0C;&#x5F53;&#x65F6;&#x8FD8;&#x50BB;&#x903C;&#x516E;&#x516E;&#x5F97;&#x89C9;&#x5F97;100&#x591A;&#x5757;&#x94B1;&#x80FD;&#x591F;&#x505A;20&#x591A;&#x5C0F;&#x65F6;&#xFF0C;&#x6361;&#x76F4;&#x4E86;&#x3002;</p>
<p> 2011&#x5E74;4&#x6708;&#x4EFD;&#x6211;&#x88AB;&#x8FEB;&#x79BB;&#x804C;&#x53BB;&#x4E86;&#x6DF1;&#x5733;&#xFF0C;&#x8868;&#x54E5;&#x63A5;&#x5F85;&#x4E86;&#x6211;&#xFF0C;&#x8FD9;&#x5E74;&#x6211;Get&#x4E86;&#x62BD;&#x70DF;&#x6280;&#x80FD;&#xFF0C;&#x4EBA;&#x751F;&#x7684;&#x7B2C;&#x4E00;&#x53E3;&#x70DF;&#x662F;&#x5728;2011&#x5E74;4&#x6708;1x&#x65E5;&#x7684;&#x4E00;&#x4E2A;&#x591C;&#x665A;&#xFF0C;&#x6211;&#x4ECE;&#x515C;&#x91CC;&#x638F;&#x51FA;&#x4E00;&#x76D2;&#x9EC4;&#x9E64;&#x697C;&#xFF08;&#x7EA2;&#x786C;&#xFF1A;&#x6E56;&#x5317;&#x540D;&#x70DF;&#xFF09;&#xFF0C;&#x70DF;&#x662F;&#x4ECE;&#x5BB6;&#x91CC;&#x62FF;&#x7684;&#xFF0C;&#x70B9;&#x71C3;&#x4E00;&#x652F;&#xFF0C;&#x4E4B;&#x524D;&#x90FD;&#x662F;&#x62BD;&#x5047;&#x70DF;&#xFF0C;&#x4E00;&#x4E2A;&#x4E0D;&#x7ECF;&#x610F;&#x6211;&#x5C31;&#x628A;&#x5B83;&#x541E;&#x8FDB;&#x53BB;&#x4E86;&#xFF0C;&#x77AC;&#x95F4;&#x611F;&#x89C9;&#x5934;&#x6655;&#x6655;&#x7684;&#xFF0C;&#x9887;&#x662F;&#x5174;&#x594B;&#x523A;&#x6FC0;&#xFF0C;&#x7ED3;&#x679C;&#x5C31;&#x4F1A;&#x4E86;&#x3002;&#x5230;&#x4E86;&#x6DF1;&#x5733;&#x540E;&#x6211;&#x5728;&#x5357;&#x5C71;&#x533A;&#x56FD;&#x9645;&#x5E02;&#x957F;&#x4EA4;&#x6D41;&#x4E2D;&#x5FC3;&#x67D0;&#x7F51;&#x7EDC;&#x516C;&#x53F8;&#x5165;&#x804C;&#xFF0C;&#x627E;&#x4E86;&#x4E00;&#x4E2A;&#x6708;&#x5DE5;&#x4F5C;&#xFF0C;&#x7B49;&#x624B;&#x5934;&#x7F13;&#x548C;&#x540E;&#x5728;&#x5B9D;&#x5B89;&#x533A;&#x576A;&#x6D32;&#x5730;&#x94C1;&#x7AD9;&#x9644;&#x8FD1;&#x79DF;&#x623F;&#xFF0C;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x5979;&#x53BB;&#x4E86;&#x9EC4;&#x96EA;&#x6885;&#x5382;&#x91CC;&#xFF0C;&#x5728;&#x7EA2;&#x82B1;&#x5CAD;&#x5DE5;&#x4E1A;&#x56ED;&#x533A;&#xFF0C;&#x5E73;&#x65F6;&#x5468;&#x672B;&#x6211;&#x8DDF;&#x5979;&#x4F1A;&#x89C1;&#x6B21;&#x9762;&#xFF0C;&#x901B;&#x901B;&#x9644;&#x8FD1;&#x7684;&#x5929;&#x8679;&#xFF0C;&#x5728;&#x5F53;&#x65F6;&#x5370;&#x8C61;&#x6700;&#x6DF1;&#x7684;&#x662F;&#x53BB;&#x8D85;&#x5E02;&#x76F8;&#x4E2D;&#x4E86;&#x4E00;&#x53CC;&#x978B;&#xFF0C;&#x540A;&#x724C;&#x4EF7;729RMB&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x633A;&#x6F02;&#x4EAE;&#xFF0C;&#x5979;&#x7A7F;&#x4E0A;&#x4E00;&#x5B9A;&#x5F88;&#x7F8E;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x7B49;&#x5C4C;&#x4E1D;&#x53EA;&#x80FD;&#x770B;&#x770B;&#xFF0C;&#x5176;&#x5B9E;&#x5F53;&#x65F6;&#x771F;&#x60F3;&#x72E0;&#x4E0B;&#x5FC3;&#x4E70;&#x4E86;&#xFF0C;&#x53C8;&#x60F3;&#x4E70;&#x4E86;&#x5B83;&#x4F60;&#x559D;&#x897F;&#x5317;&#x98CE;&#xFF08;po&#x4E3B;low&#x6BD4;&#xFF09;&#x3002;&#x56E0;&#x4E3A;&#x5DE5;&#x4F5C;&#x6BD4;&#x8F83;&#x5FD9;&#x788C;&#xFF0C;&#x5927;&#x5BB6;&#x4F19;&#x4E5F;&#x90FD;&#x77E5;&#x9053;&#x50CF;&#x6211;&#x4EEC;&#x8FD9;&#x79CD;&#x7801;&#x755C;&#xFF0C;&#x52A0;&#x73ED;&#x52A0;&#x73ED;&#x52A0;&#x73ED;&#x800C;&#x4E14;&#x516C;&#x53F8;&#x8FD8;&#x4E0D;&#x80AF;&#x62DB;&#x4EBA;&#xFF0C;&#x516C;&#x53F8;&#x9500;&#x552E;&#x5BF9;&#x5916;&#x778E;&#x903C;&#x5439;&#x725B;&#xFF0C;&#x63A5;&#x5230;&#x5B89;&#x5948;&#x513F;&#x7684;&#x4E00;&#x4E2A;&#x79EF;&#x5206;&#x5238;&#x6D3B;&#x52A8;&#x4E1A;&#x52A1;&#xFF0C;&#x73B0;&#x5728;&#x60F3;&#x60F3;&#x90FD;&#x540E;&#x6015;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E1A;&#x52A1;&#x81F3;&#x5C11;&#x662F;Senior Engineer&#x624D;&#x80FD;&#x62FF;&#x4E0B;&#x7684;&#xFF0C;&#x5929;&#x5929;&#x52A0;&#x73ED;&#x538B;&#x529B;&#x5927;&#x5F97;&#x4E00;&#x6BD4;&#xFF0C;&#x4E4B;&#x524D;&#x7684;&#x6210;&#x5C31;&#x611F;&#x5168;&#x65E0;&#xFF0C;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x4E00;&#x56E2;&#x7CDF;&#xFF0C;&#x516C;&#x53F8;&#x4EC0;&#x4E48;&#x90FD;&#x8BA9;&#x4F60;&#x4E0A;&#xFF0C;&#x6211;&#x7EC8;&#x7A76;&#x6CA1;&#x6709;&#x9876;&#x4F4F;&#x538B;&#x529B;&#x6700;&#x7EC8;&#x6709;&#x610F;&#x5411;&#x95EA;&#x4EBA;&#x3002;&#x5173;&#x4E8E;&#x8FD9;&#x6BB5;&#x73CD;&#x8D35;&#x7684;&#x8BB0;&#x5FC6;&#x53EF;&#x4EE5;&#x53C2;&#x770B;&#x300A;&#x4F83;&#x4F83;&#x2013;&#x6DF1;&#x5733;&#x300B;&#xFF0C;&#x5230;&#x4E86;7&#x6708;&#x4EFD;&#x56DE;&#x5BB6;&#x62FF;&#x6BD5;&#x4E1A;&#x8BC1;&#xFF0C;&#x5306;&#x5306;&#x5FD9;&#x5FD9;&#x8DDF;&#x65E5;&#x5929;&#x4EEC;&#x628A;&#x9152;&#x989C;&#x6B22; &#xFF0C;&#x53D1;&#x6CC4;&#x538B;&#x529B;&#x5403;&#x559D;&#x62BD;&#x5531;&#xFF0C;&#x9EC4;&#x65E5;&#x5929;&#x603B;&#x6709;&#x65E0;&#x7A77;&#x65E0;&#x5C3D;&#x7684;&#x70DF;&#x8349;&#xFF0C;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x8DDF;&#x59B9;&#x5B50;&#x5173;&#x7CFB;&#x4E5F;&#x5F88;&#x7D27;&#x5F20;&#xFF1B;&#x518D;&#x6B21;&#x56DE;&#x5230;&#x6DF1;&#x5733;&#xFF0C;&#x7EE7;&#x7EED;&#x594B;&#x6218;&#x90A3;&#x4E2A;X&#x9879;&#x76EE;&#xFF0C;&#x7EC8;&#x7A76;&#x6CA1;&#x80FD;&#x9876;&#x4F4F;&#x538B;&#x529B;&#xFF0C;&#x8FD8;&#x843D;&#x5F97;&#x4E86;&#x5728;&#x8857;&#x5934;&#x7761;&#x4E86;&#x4E00;&#x5BBF;&#xFF0C;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x4E0D;&#x5982;&#x610F;&#x7684;&#x4E8B;&#x60C5;&#x4E00;&#x4EF6;&#x63A5;&#x7740;&#x4E00;&#x4EF6;&#xFF0C;&#x9996;&#x5148;&#x662F;&#x81EA;&#x5DF1;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x524D;&#x9014;&#x672A;&#x535C;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;&#x8DDF;&#x59B9;&#x5B50;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x73B0;&#x5728;&#x56DE;&#x60F3;&#x8D77;&#x6765;2011&#x5E74;&#x5176;&#x5B9E;&#x662F;&#x6700;&#x4F73;&#x7ED3;&#x5A5A;&#x65F6;&#x673A;&#xFF0C;&#x53EF;&#x662F;&#x9519;&#x8FC7;&#x4E86;&#x4E5F;&#x8BB8;&#x5C31;&#x9519;&#x8FC7;&#x4E86;&#x3002;&#x6DF1;&#x591C;&#x91CC;&#x6211;&#x4F1A;&#x4E0D;&#x81EA;&#x4E3B;&#x638F;&#x51FA;&#x4E00;&#x6839;&#x91D1;&#x767D;&#x9CA8;&#xFF0C;&#x9759;&#x9759;&#x5730;&#x5438;&#x7740;&#xFF0C;&#x770B;&#x7740;&#x706B;&#x5149;&#x4E00;&#x95EA;&#x4E00;&#x95EA;&#xFF0C;&#x7247;&#x523B;&#x949F;&#x540E;&#x5C06;&#x70DF;&#x8482;&#x8F7B;&#x8F7B;&#x5F39;&#x51FA;&#xFF0C;&#x70DF;&#x8482;&#x5728;&#x591C;&#x7A7A;&#x4E2D;&#x5212;&#x51FA;&#x4E00;&#x5230;&#x7F8E;&#x4E3D;&#x7684;&#x5F27;&#x5F62;&#xFF0C;&#x843D;&#x5230;&#x704C;&#x6728;&#x8349;&#x4E1B;&#x4E2D;&#xFF08;&#x8BF7;&#x6CE8;&#x610F;&#x8FD9;&#x4E2A;&#x7EC6;&#x8282;&#xFF09;&#x3002;po&#x4E3B;&#x6700;&#x7EC8;&#x51B3;&#x5B9A;&#x53BB;&#x5317;&#x4EAC;&#xFF0C;&#x5728;&#x4E34;&#x8D70;&#x524D;&#x6731;&#x65E5;&#x5929;&#x548C;&#x660E;&#x955C;&#x7F8E;&#x7537;&#x5B50;&#x8FD8;&#x4E00;&#x8D77;&#x53BB;&#x4E86;&#x8D9F;&#x6DF1;&#x5733;&#x5927;&#x6885;&#x6C99;&#xFF0C;&#x5F53;&#x521D;&#x8FD8;&#x7EA6;&#x4E86;&#x5F20;&#x65E5;&#x5929;&#xFF0C;&#x7ECF;&#x7406;&#x5F20;&#x5F53;&#x65F6;&#x4E1A;&#x52A1;&#x7E41;&#x5FD9;&#x6CA1;&#x6709;&#x805A;&#x6210;&#x2026;9&#x6708;&#x4EFD;&#x5979;&#x5728;&#x6DF1;&#x5733;&#x7AD9;&#x9001;&#x6211;&#x5230;&#x5317;&#x4EAC;&#x3002;</p>
<p>po&#x4E3B;2011&#x5E74;12&#x6708;&#x4EFD;&#x5165;&#x804C;&#x5317;&#x4EAC;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#xFF0C;&#x804C;&#x4E1A;&#xFF1A;&#x642C;&#x7816;&#xFF0C;&#x7ED3;&#x5B9E;&#x597D;&#x53CB;&#x8001;&#x4E09;&#xFF08;&#x675C;&#x53EC;&#xFF09;&#xFF0C;&#x6700;&#x7EC8;&#x4E0E;&#x4ED6;&#x5728;&#x52B2;&#x677E;&#x5408;&#x79DF;&#xFF08;&#x5176;&#x5B9E;&#x6700;&#x5F00;&#x59CB;&#x662F;&#x5728;&#x5C4E;&#x5404;&#x5E84;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4FE9;&#x6700;&#x540E;&#x5DE5;&#x4F5C;&#x90FD;&#x627E;&#x5230;&#x4E86;&#x52B2;&#x677E;&#x9644;&#x8FD1;&#xFF0C;&#x5C4E;&#x5404;&#x5E84;&#x4FBF;&#x5B9C;&#xFF0C;&#x50CF;&#x6211;&#x8FD9;Level&#x7801;&#x755C;&#x9996;&#x9009;&#xFF09;&#x3002;&#x8001;&#x4E09;&#x77F3;&#x5BB6;&#x5E84;&#x4EBA;&#xFF0C;&#x4EBA;&#x803F;&#x76F4;&#x6734;&#x5B9E;&#xFF0C;&#x4E5F;&#x7740;&#x5B9E;&#x8BA9;&#x6211;&#x5BF9;&#x77F3;&#x5BB6;&#x5E84;&#x4EBA;&#x5370;&#x8C61;&#x5F88;&#x597D;&#xFF0C;&#x5230;&#x5317;&#x4EAC;&#x540E;&#x6211;&#x611F;&#x89C9;&#x8857;&#x4E0A;&#x7684;&#x59B9;&#x5B50;&#x8D28;&#x91CF;&#x4E0D;&#x5982;&#x5357;&#x65B9;&#xFF0C;&#x800C;&#x4E14;&#x5E74;&#x9F84;&#x666E;&#x904D;&#x504F;&#x5927;&#xFF0C;&#x5317;&#x65B9;&#x4EBA;&#x4F3C;&#x4E4E;&#x4E0D;&#x592A;&#x8BB2;&#x7A76;&#x7A7F;&#x7740;&#x3002;&#x59B9;&#x5B50;&#x5728;2012&#x5E74;4&#x6708;&#x4EFD;&#x968F;&#x6211;&#x5230;&#x7684;&#x5317;&#x4EAC;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x76F8;&#x9022;&#xFF0C;&#x641E;&#x4E0D;&#x6E05;&#x695A;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#x5C31;&#x53C8;&#x5728;&#x4E00;&#x8D77;&#x4E86;&#xFF0C;&#x5176;&#x5B9E;&#x5728;&#x5317;&#x4EAC;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x6211;&#x4EEC;&#x4E5F;&#x9010;&#x6E10;&#x88AB;&#x78E8;&#x783A;&#x5F97;&#x4E0D;&#x518D;&#x68F1;&#x89D2;&#x5206;&#x660E;&#xFF0C;&#x6162;&#x6162;&#x5706;&#x6DA6;&#x4E86;&#x8BB8;&#x591A;&#xFF0C;&#x5728;&#x5317;&#x4EAC;&#x4E00;&#x8DEF;&#x8D70;&#x6765;&#x8FD8;&#x7B97;&#x987A;&#x5229;&#xFF0C;&#x59B9;&#x5B50;&#x4E5F;&#x987A;&#x5229;&#x8F6C;&#x578B;&#x6280;&#x672F;&#x7EBF;&#x8DEF;&#xFF0C;&#x6211;&#x4E5F;&#x9010;&#x6E10;&#x53D8;&#x80D6;&#xFF0C;&#x4ECE;&#x5927;&#x5B66;&#x90A3;&#x4F1A;&#x513F;118&#x65A4;&#xFF0C;&#x5230;&#x5CF0;&#x503C;&#x6709;158&#x65A4;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x88AB;&#x5979;&#x5ACC;&#x5F03;&#x9119;&#x89C6;&#xFF0C;&#x5979;&#x5E72;&#x8106;&#x53EB;&#x6211;&#x80D6;&#x5B50;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x8BF4;&#x6211;&#x817F;&#x77ED;&#xFF0C;&#x6211;&#x8BF4;&#x5979;&#x4E0D;&#x7231;&#x6253;&#x626E;&#xFF0C;&#x5929;&#x5929;&#x6574;&#x5F97;&#x8DDF;&#x4E00;&#x5C0F;&#x5B66;&#x751F;&#x4F3C;&#x7684;&#xFF0C;&#x5979;&#x8BF4;&#x6211;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5174;&#x8DA3;&#x7231;&#x597D;&#xFF0C;&#x9664;&#x4E86;IT&#x5C31;&#x6CA1;&#x522B;&#x7684;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x73A9;&#x6E38;&#x620F;&#xFF0C;&#x5979;&#x5012;&#x5E0C;&#x671B;&#x6211;Get&#x8FD9;&#x4E2A;&#x6280;&#x80FD;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x60F3;&#x627E;&#x8D44;&#x6DF1;&#x73A9;&#x5BB6;&#x5218;&#x65E5;&#x5929;&#xFF08;&#x8D44;&#x6DF1;&#x4E2A;&#x9E21;&#x6BDB;&#xFF0C;&#x5927;&#x5B66;&#x90A3;&#x4F1A;&#x513F;&#x5929;&#x5929;&#x8DDF;&#x5F90;&#x65E5;&#x5929;&#x5728;&#x5BDD;&#x5BA4;&#x778E;BB&#xFF09;&#x5E26;&#x6211;&#xFF0C;&#x5218;&#x65E5;&#x5929;&#x8BF4;&#x609F;&#x6027;&#x592A;&#x4F4E;&#x4E0D;&#x613F;&#x610F;&#x5E26;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x552F;&#x4E00;&#x7684;&#x7231;&#x597D;&#x4E5F;&#x8BB8;&#x5C31;&#x662F;&#x62BD;&#x70DF;&#x559D;&#x9152;&#x8DDF;&#x65E5;&#x5929;&#x4EEC;&#x4E00;&#x987F;&#x80E1;&#x4F83;&#x704C;&#x6C34;&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x8FD1;&#x53D1;&#x73B0;&#x8EAB;&#x4F53;&#x5927;&#x4E0D;&#x5982;&#x4ECE;&#x524D;&#x4E86;&#xFF0C;&#x5E72;&#x8106;&#x8FDE;&#x6700;&#x540E;&#x4EC5;&#x5B58;&#x7684;&#x7231;&#x597D;&#x4E5F;&#x6212;&#x4E86;&#xFF08;&#x73B0;&#x5728;&#x8BE5;&#x56DE;&#x5230;&#x9AD8;&#x4E2D;&#x65F6;&#x4EE3;&#xFF0C;&#x51AC;&#x5929;&#x51B2;&#x51B7;&#x6C34;&#x6FA1;&#xFF0C;&#x6BCF;&#x5929;&#x575A;&#x6301;&#x8DD1;&#x6B65;3.4&#x516C;&#x91CC;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x505A;&#x5230;&#x4E86;&#xFF09;&#x3002;&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x5317;&#x4EAC;&#x751F;&#x6D3B;&#x771F;&#x5B9E;&#x5199;&#x7167;&#xFF0C;&#x5E74;&#x5E95;&#x5979;&#x4E5F;&#x5FD9;&#x8D77;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x4E03;&#x5E74;&#x4E4B;&#x75D2;&#xFF0C;&#x5C31;&#x50CF;po&#x4E3B;&#x6700;&#x5F00;&#x59CB;&#x63A8;&#x8350;&#x7684;&#x90A3;&#x9996;&#x300A;&#x5927;&#x8BDD;&#x897F;&#x6E38;&#x300B;&#x7247;&#x5C3E;&#x66F2;&#xFF0C;&#x60F3;&#x8981;&#x6551;&#x7D2B;&#x971E;&#x5C31;&#x5FC5;&#x987B;&#x8981;&#x6253;&#x8D25;&#x725B;&#x9B54;&#x738B;&#xFF0C;&#x60F3;&#x8981;&#x6253;&#x8D25;&#x725B;&#x9B54;&#x738B;&#x5C31;&#x5FC5;&#x987B;&#x8981;&#x53D8;&#x6210;&#x5B59;&#x609F;&#x7A7A;&#xFF0C;&#x60F3;&#x8981;&#x53D8;&#x6210;&#x5B59;&#x609F;&#x7A7A;&#x5C31;&#x5FC5;&#x987B;&#x5FD8;&#x6389;&#x4E03;&#x60C5;&#x516D;&#x6B32;&#x4ECE;&#x6B64;&#x4E0D;&#x80FD;&#x518D;&#x6709;&#x534A;&#x70B9;&#x6C61;&#x67D3;&#x3002;</p>
<p>&#x4ECE;2008-2015&#x5E74;&#xFF0C;&#x6211;&#x548C;&#x5979;&#x4E00;&#x8DEF;&#x8D70;&#x8FC7;7&#x4E2A;&#x6625;&#x79CB;&#xFF0C;&#x7279;&#x6B64;&#x544A;&#x8BC9;&#x5927;&#x5BB6;&#x4E00;&#x4E2A;&#x559C;&#x8BAF;&#xFF0C;&#x6211;&#x548C;&#x674E;&#x4E9A;&#x5E73;2015&#x5E74;12&#x6708;12&#x65E5;&#xFF08;&#x519C;&#x5386;&#xFF09;&#x4E8E;&#x8001;&#x5BB6;&#x4E3E;&#x529E;&#x5A5A;&#x793C;&#xFF01;&#x8BDA;&#x9080;&#x65E5;&#x5929;&#x4EEC;&#xFF08;&#x5305;&#x62EC;&#x300A;&#x9AD8;&#x4E2D;&#x6211;&#x4EEC;&#x805A;&#x805A;&#x300B;&#x5168;&#x5458;&#xFF0C;&#x591A;&#x5E74;&#x540E;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x4E2A;&#x80FD;&#x6709;&#x591A;&#x5C11;&#x80FD;&#x8010;&#x8BA9;&#x5144;&#x5F1F;&#x4EEC;&#x805A;&#x5728;&#x4E00;&#x8D77;&#xFF09;&#x628A;&#x9152;&#x6B22;&#x8A00;&#xFF01;&#x8C22;&#x8C22;&#x5927;&#x5BB6;&#xFF01;      </p>
<p>&#x3010;&#x7167;&#x7247;&#x3011;</p>
<p><img src="/2015/12/17/see-end/1.jpg" alt></p>
<p><img src="/2015/12/17/see-end/2.jpg" alt></p>
<p><img src="/2015/12/17/see-end/3.jpg" alt></p>
<p><img src="/2015/12/17/see-end/4.jpg" alt></p>
<p><img src="/2015/12/17/see-end/5.jpg" alt></p>
<p>&#x3010;&#x7167;&#x7247;&#x6700;&#x540E;&#x4E00;&#x5F20;&#x6CA1;&#x6709;&#x6DFB;&#x52A0;&#x4EFB;&#x4F55;&#x4FEE;&#x9970;&#xFF0C;po&#x4E3B;&#x51B3;&#x5B9A;&#x51CF;&#x6389;&#x80A5;&#x8089;&#x91CD;&#x8FD4;18&#x5C81;&#xFF01;&#x4EBA;&#x7269;&#x4E0D;&#x5206;&#x5148;&#x540E;&#x9650;&#x4E8E;&#x7BC7;&#x5E45;&#x5F88;&#x591A;&#x7CBE;&#x5F69;&#x4EBA;&#x7269;po&#x4E3B;&#x672A;&#x80FD;&#x63D0;&#x53CA;&#xFF0C;&#x656C;&#x8BF7;&#x5927;&#x5BB6;&#x8C05;&#x89E3;&#xFF01;&#x611F;&#x8C22;&#x5927;&#x5BB6;&#xFF01;&#x518D;&#x6B21;&#x611F;&#x8C22;&#x5927;&#x5BB6;&#xFF01;&#x3011;</p>
<p>&#x3010;&#x5199;&#x5728;&#x6700;&#x540E;&#x3011;</p>
<p>&#x9752;&#x6625;&#x7684;&#x571F;&#x58E4;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x8BB0;&#x5FC6;&#x662F;&#x6F6E;&#x6E7F;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x662F;&#x690D;&#x7269;&#xFF0C;&#x4E0D;&#x80FD;&#x5728;&#x8FD9;&#x5757;&#x571F;&#x5730;&#x4E0A;&#x751F;&#x751F;&#x4E0D;&#x606F;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x56DE;&#x7738;&#x9752;&#x6625;&#xFF0C;&#x4EFF;&#x4F5B;&#x6709;&#x4E00;&#x79CD;&#x8BF4;&#x4E0D;&#x51FA;&#x7684;&#x75DB;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x4F1A;&#x95EE;&#xFF0C;&#x9752;&#x6625;&#x7684;&#x8BC0;&#x522B;&#x662F;&#x5426;&#x610F;&#x5473;&#x7740;&#x5E74;&#x8FC8;&#x7684;&#x5C06;&#x8FD1;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x9752;&#x6625;&#xFF0C;&#x5979;&#x4E00;&#x76F4;&#x90FD;&#x5728;&#x7EE7;&#x7EED;&#x2026;&#x2026;</p>

      

      
        
    </div>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/04/08/weixin-auth/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          微信页面授权登陆
        
      </div>
    </a>
  
  
    <a href="/2015/09/08/weixin-share/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">微信页面分享实现</div>
    </a>
  
</nav>

  
</article>


<section id="comments">
  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="post-see-end" data-title="侃侃--结局" data-url="http://everyding.github.io/2015/12/17/see-end/" data-limit="50"></div>
  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
    var duoshuoQuery = {short_name:'eval'};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>
  <!-- 多说公共JS代码 end -->
</section>
</section>
        <aside id="sidebar">
  <nav class="menus">
  	<ul>
  		<li><a href="/"><i class="icon icon-home"></i></a></li>
  		
			<li><a href="/archives"><i class="icon icon-fenlei"></i></a></li>
  		
  		
			<li><a href="/tags"><i class="icon icon-tag"></i></a></li>
  		
  		
  			<li><a href="https://github.com/everyding" target="_blank"><i class="icon icon-github"></i></a></li>
  		
  	</ul>
  </nav>
  <a id="go-top" href="#"><i class="icon icon-up"></i></a>
</aside>
      </div>
      <footer id="footer">
  
	<div id="footer-info" class="inner">
	  &copy; 2019 eval 
	  - Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
	  - Theme <a href="https://github.com/Alex-fun/hexo-theme-jane/" target="_blank">Jane</a>
	</div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/tags" class="mobile-nav-link">Tag</a>
  
    <a href="https://github.com/everyding" class="mobile-nav-link">Github</a>
  
</nav>
    

<script src="//cdn.bootcss.com/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>